/*
#############################################################################################
# Alice2 (ASDK) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.6
# ========================================================================================= #
# File: AliceGame_parameters.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function AliceGame.AimSwitchActorBase.DamageByProjectile
// [0x00020802] 
struct AAimSwitchActorBase_eventDamageByProjectile_Params
{
	class AProjectile*                                 Proj;                                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AimSwitchActorBase.TriggerDamage
// [0x00020800] 
struct AAimSwitchActorBase_eventTriggerDamage_Params
{
};

// Function AliceGame.AimSwitchActorBase.OnToggle
// [0x00020102] 
struct AAimSwitchActorBase_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AimSwitchActorBase.PlayDamageAnim
// [0x00020101] 
struct AAimSwitchActorBase_execPlayDamageAnim_Params
{
};

// Function AliceGame.AimSwitchActorBase.PlaySlotAnim
// [0x00024101] 
struct AAimSwitchActorBase_execPlaySlotAnim_Params
{
	class FName                                        AnimName;                                         // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bLoop : 1;                                        // 0x0008 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function AliceGame.AimSwitchActorBase.PostBeginPlay
// [0x00020902] 
struct AAimSwitchActorBase_eventPostBeginPlay_Params
{
};

// Function AliceGame.AimSwitchActorBase.PreBeginPlay
// [0x00020900] 
struct AAimSwitchActorBase_eventPreBeginPlay_Params
{
};

// Function AliceGame.AimSwitchActorBase.SetInitialState
// [0x00020902] 
struct AAimSwitchActorBase_eventSetInitialState_Params
{
};

// Function AliceGame.AimSwitchActorBase.CacheAnimNodes
// [0x00020102] 
struct AAimSwitchActorBase_execCacheAnimNodes_Params
{
	// class UAnimNodeSlot*                            TempSlotNode;                                     // 0x0000 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AimSwitchActorBase.CalcAnimPosPara
// [0x00020103] 
struct AAimSwitchActorBase_execCalcAnimPosPara_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// float                                           BloodPercent;                                     // 0x0004 (0x0004) [0x0000000000000000]               
	// int32_t                                         BloodAbsValue;                                    // 0x0008 (0x0004) [0x0000000000000000]               
	// int32_t                                         I;                                                // 0x000C (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AimSwitchActorBase.PlayDeathEffect
// [0x00020400]  (iNative[38010])
struct AAimSwitchActorBase_execPlayDeathEffect_Params
{
};

// Function AliceGame.AimSwitchActorBase.UpdateAfterAcceptPersistentDate
// [0x00020802] 
struct AAimSwitchActorBase_eventUpdateAfterAcceptPersistentDate_Params
{
};

// Function AliceGame.AimSwitchActorBase.ApplyCheckpointRecord
// [0x00420002] 
struct AAimSwitchActorBase_execApplyCheckpointRecord_Params
{
	struct AAimSwitchActorBase_FCheckpointRecord       Record;                                           // 0x0000 (0x0020) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function AliceGame.AimSwitchActorBase.CreateCheckpointRecord
// [0x00420002] 
struct AAimSwitchActorBase_execCreateCheckpointRecord_Params
{
	struct AAimSwitchActorBase_FCheckpointRecord       Record;                                           // 0x0000 (0x0020) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function AliceGame.AliceCheckpoint.PostSaveCheckpoint
// [0x00020802] 
struct UAliceCheckpoint_eventPostSaveCheckpoint_Params
{
	// class AAlicePlayerController*                   APC;                                              // 0x0000 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceCheckpoint.PreSaveCheckpoint
// [0x00020800] 
struct UAliceCheckpoint_eventPreSaveCheckpoint_Params
{
};

// Function AliceGame.AliceCheckpoint.PostLoadCheckpoint
// [0x00020802] 
struct UAliceCheckpoint_eventPostLoadCheckpoint_Params
{
	// class AAlicePlayerController*                   APC;                                              // 0x0000 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceCheckpoint.PreLoadCheckpoint
// [0x00020800] 
struct UAliceCheckpoint_eventPreLoadCheckpoint_Params
{
};

// Function AliceGame.AliceCheckpoint.GetAlicePlayerController
// [0x00020400]  (iNative[34497])
struct UAliceCheckpoint_execGetAlicePlayerController_Params
{
	class AAlicePlayerController*                      ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceCheckpoint.CheckpointIsNewer
// [0x00020003] 
struct UAliceCheckpoint_execCheckpointIsNewer_Params
{
	class UAliceCheckpoint*                            OtherCheckpoint;                                  // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// uint32_t                                        bResult : 1;                                      // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function AliceGame.AliceCheckpoint.CheckpointTimeIsNewer
// [0x00422003] 
struct UAliceCheckpoint_execCheckpointTimeIsNewer_Params
{
	struct FCheckpointTime                             GameCheckpointTime;                               // 0x0000 (0x0010) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FCheckpointTime                             OtherCheckpointTime;                              // 0x0010 (0x0010) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  // 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// uint32_t                                        bResult : 1;                                      // 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function AliceGame.AliceCheckpoint.CheckpointIsEmpty
// [0x00020803] 
struct UAliceCheckpoint_eventCheckpointIsEmpty_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceCheckPointManager.UpdateRegisterWhenChangeCallFromBase
// [0x00020002] 
struct AAliceCheckPointManager_execUpdateRegisterWhenChangeCallFromBase_Params
{
	class AActor*                                      RegisterActor;                                    // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      OutName;                                          // 0x0004 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ActorFName;                                       // 0x0010 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function AliceGame.AliceCheckPointManager.UnRegisterWhenApplyRecordCallFromBase
// [0x00020002] 
struct AAliceCheckPointManager_execUnRegisterWhenApplyRecordCallFromBase_Params
{
	class AActor*                                      RegisterActor;                                    // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      OutName;                                          // 0x0004 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ActorFName;                                       // 0x0010 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function AliceGame.AliceCheckPointManager.RegisterWhenApplyRecordCallFromBase
// [0x00020002] 
struct AAliceCheckPointManager_execRegisterWhenApplyRecordCallFromBase_Params
{
	class AActor*                                      RegisterActor;                                    // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      OutName;                                          // 0x0004 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ActorFName;                                       // 0x0010 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function AliceGame.AliceCheckPointManager.RegisterWhenPostBeginPlayCallFromBase
// [0x00020002] 
struct AAliceCheckPointManager_execRegisterWhenPostBeginPlayCallFromBase_Params
{
	class AActor*                                      RegisterActor;                                    // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceCheckPointManager.UpdateRegisterWhenChange
// [0x00020400]  (iNative[42118])
struct AAliceCheckPointManager_execUpdateRegisterWhenChange_Params
{
	class AActor*                                      RegisterActor;                                    // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      OutName;                                          // 0x0004 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ActorFName;                                       // 0x0010 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function AliceGame.AliceCheckPointManager.UnRegisterWhenApplyRecord
// [0x00020400]  (iNative[42060])
struct AAliceCheckPointManager_execUnRegisterWhenApplyRecord_Params
{
	class AActor*                                      RegisterActor;                                    // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      OutName;                                          // 0x0004 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ActorFName;                                       // 0x0010 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function AliceGame.AliceCheckPointManager.RegisterWhenApplyRecord
// [0x00020400]  (iNative[38708])
struct AAliceCheckPointManager_execRegisterWhenApplyRecord_Params
{
	class AActor*                                      RegisterActor;                                    // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      OutName;                                          // 0x0004 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ActorFName;                                       // 0x0010 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function AliceGame.AliceCheckPointManager.RegisterWhenPostBeginPlay
// [0x00020400]  (iNative[38709])
struct AAliceCheckPointManager_execRegisterWhenPostBeginPlay_Params
{
	class AActor*                                      RegisterActor;                                    // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceChessPiece.CancelDizzy
// [0x00020800] 
struct AAliceChessPiece_eventCancelDizzy_Params
{
};

// Function AliceGame.AliceChessPiece.OnAnimEnd
// [0x00020802] 
struct AAliceChessPiece_eventOnAnimEnd_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayedTime;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ExcessTime;                                       // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceChessTrap.ChessTrapAttackHit
// [0x00020802] 
struct AAliceChessTrap_eventChessTrapAttackHit_Params
{
};

// Function AliceGame.AliceChessTrap.OnAnimEnd
// [0x00020800] 
struct AAliceChessTrap_eventOnAnimEnd_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayedTime;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ExcessTime;                                       // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceChessTrap.CheckTrap
// [0x00020002] 
struct AAliceChessTrap_execCheckTrap_Params
{
	class AAliceChessBoard*                            board;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceChessTrap.PostStep
// [0x00020002] 
struct AAliceChessTrap_execPostStep_Params
{
	class AAliceChessBoard*                            board;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceChessTrap.MoveTrap
// [0x00C20002] 
struct AAliceChessTrap_execMoveTrap_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class TArray<struct FVector>                       GridLocArray;                                     // 0x0004 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	struct AAliceBlockPuzzleBoard_FPieceLoc            WhitePieceLoc;                                    // 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct AAliceBlockPuzzleBoard_FPieceLoc            BlackPieceLoc;                                    // 0x0018 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            GridNum;                                          // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AAliceChessBoard*                            board;                                            // 0x0024 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// struct AAliceBlockPuzzleBoard_FPieceLoc         StartLoc;                                         // 0x0028 (0x0008) [0x0000000000000000]               
	// struct AAliceBlockPuzzleBoard_FPieceLoc         EndLoc;                                           // 0x0030 (0x0008) [0x0000000000000000]               
	// struct FVector                                  VDir;                                             // 0x0038 (0x000C) [0x0000000000000000]               
	// struct FVector                                  vEndLoc;                                          // 0x0044 (0x000C) [0x0000000000000000]               
	// struct FVector                                  vStartLoc;                                        // 0x0050 (0x000C) [0x0000000000000000]               
};

// Function AliceGame.AliceChessTrap.IsMoving
// [0x00020002] 
struct AAliceChessTrap_execIsMoving_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceChessTrap.setMovingRotation
// [0x00820002] 
struct AAliceChessTrap_execsetMovingRotation_Params
{
	// uint8_t                                         movingRotation;                                   // 0x0000 (0x0001) [0x0000000000000000]               
	// struct AAliceBlockPuzzleBoard_FPieceLoc         CurLoc;                                           // 0x0004 (0x0008) [0x0000000000000000]               
	// struct AAliceBlockPuzzleBoard_FPieceLoc         nextLoc;                                          // 0x000C (0x0008) [0x0000000000000000]               
};

// Function AliceGame.AliceChessTrap.doKillAction
// [0x00020002] 
struct AAliceChessTrap_execdoKillAction_Params
{
};

// Function AliceGame.AliceChessTrap.checkKillAction
// [0x00820002] 
struct AAliceChessTrap_execcheckKillAction_Params
{
	// struct AAliceBlockPuzzleBoard_FPieceLoc         nextLoc;                                          // 0x0000 (0x0008) [0x0000000000000000]               
};

// Function AliceGame.AliceChessTrap.onStartMove
// [0x00020002] 
struct AAliceChessTrap_execonStartMove_Params
{
};

// Function AliceGame.AliceChessTrap.SetNextPath
// [0x00020002] 
struct AAliceChessTrap_execSetNextPath_Params
{
};

// Function AliceGame.AliceChessTrap.GetNextLoc
// [0x00020002] 
struct AAliceChessTrap_execGetNextLoc_Params
{
	struct AAliceBlockPuzzleBoard_FPieceLoc            ReturnValue;                                      // 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceChessTrap.GetLoc
// [0x00020002] 
struct AAliceChessTrap_execGetLoc_Params
{
	struct AAliceBlockPuzzleBoard_FPieceLoc            ReturnValue;                                      // 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceChessTrap.GetNextPathID
// [0x00020002] 
struct AAliceChessTrap_execGetNextPathID_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// int32_t                                         NextID;                                           // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceChessTrap.GetCurPathID
// [0x00020002] 
struct AAliceChessTrap_execGetCurPathID_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceChessTrap.Init
// [0x00020002] 
struct AAliceChessTrap_execInit_Params
{
	class AAliceChessBoard*                            board;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceDodgeParticleTrace.FinishFlightEffects
// [0x00020802] 
struct AAliceDodgeParticleTrace_eventFinishFlightEffects_Params
{
};

// Function AliceGame.AliceDodgeParticleTrace.SpawnFlightEffects
// [0x00020802] 
struct AAliceDodgeParticleTrace_eventSpawnFlightEffects_Params
{
};

// Function AliceGame.AliceDodgeParticleTrace.PostBeginPlay
// [0x00020102] 
struct AAliceDodgeParticleTrace_execPostBeginPlay_Params
{
};

// Function AliceGame.AliceDroppedPickup.Landed
// [0x00020902] 
struct AAliceDroppedPickup_eventLanded_Params
{
	struct FVector                                     HitNormal;                                        // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      FloorActor;                                       // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	// float                                           DotP;                                             // 0x0010 (0x0004) [0x0000000000000000]               
	// float                                           Offset;                                           // 0x0014 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceDroppedPickup.GiveTo
// [0x00020002] 
struct AAliceDroppedPickup_execGiveTo_Params
{
	class APawn*                                       P;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceDroppedPickup.SetPickupParticles
// [0x00020902] 
struct AAliceDroppedPickup_eventSetPickupParticles_Params
{
	class UParticleSystemComponent*                    NewPickupParticles;                               // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function AliceGame.AliceDroppedPickup.SetPickupMesh
// [0x00020902] 
struct AAliceDroppedPickup_eventSetPickupMesh_Params
{
	class UPrimitiveComponent*                         NewPickupMesh;                                    // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function AliceGame.AliceDroppedPickup.PreBeginPlay
// [0x00020802] 
struct AAliceDroppedPickup_eventPreBeginPlay_Params
{
};

// Function AliceGame.AliceEmitterPool.SpawnExplosionLight
// [0x00024002] 
struct AAliceEmitterPool_execSpawnExplosionLight_Params
{
	class UClass*                                      LightClass;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SpawnLocation;                                    // 0x0004 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      AttachToActor;                                    // 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UAliceExplosionLight*                        ReturnValue;                                      // 0x0014 (0x0004) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
	// class UAliceExplosionLight*                     Light;                                            // 0x0018 (0x0004) [0x0000000004000000] (CPF_EditInline)
	// int32_t                                         I;                                                // 0x001C (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceEmitterPool.OnExplosionLightFinished
// [0x00020002] 
struct AAliceEmitterPool_execOnExplosionLightFinished_Params
{
	class UAliceExplosionLight*                        Light;                                            // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	// int32_t                                         I;                                                // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceEmitterPool.SpawnEmitter
// [0x00024002] 
struct AAliceEmitterPool_execSpawnEmitter_Params
{
	class UParticleSystem*                             EmitterTemplate;                                  // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SpawnLocation;                                    // 0x0004 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    SpawnRotation;                                    // 0x0010 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      AttachToActor;                                    // 0x001C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bInheritScaleFromBase : 1;                        // 0x0020 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class UParticleSystemComponent*                    ReturnValue;                                      // 0x0024 (0x0004) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
	// class APlayerController*                        PC;                                               // 0x0028 (0x0004) [0x0000000000000000]               
	// int32_t                                         LODLevel;                                         // 0x002C (0x0004) [0x0000000000000000]               
	// class UParticleSystemComponent*                 PSC;                                              // 0x0030 (0x0004) [0x0000000004000000] (CPF_EditInline)
};

// Function AliceGame.AliceExplosionLight.SetTemplate
// [0x00420401]  (iNative[6371])
struct UAliceExplosionLight_execSetTemplate_Params
{
	struct FAliceExplosionLightTemplate                Template;                                         // 0x0000 (0x0014) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function AliceGame.AliceExplosionLight.OnLightFinished
// [0x00120000] 
struct UAliceExplosionLight_execOnLightFinished_Params
{
	class UAliceExplosionLight*                        Light;                                            // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function AliceGame.AliceExplosionLight.ResetLight
// [0x00020401]  (iNative[38759])
struct UAliceExplosionLight_execResetLight_Params
{
};

// Function AliceGame.AliceGameCrowdAgent.Tick
// [0x00020802] 
struct AAliceGameCrowdAgent_eventTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameCrowdAgent.TakeDamage
// [0x00024002] 
struct AAliceGameCrowdAgent_execTakeDamage_Params
{
	int32_t                                            DamageAmount;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 EventInstigator;                                  // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Momentum;                                         // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UClass*                                      DamageType;                                       // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               HitInfo;                                          // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      DamageCauser;                                     // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function AliceGame.AliceGameCrowdAgent.PickBehaviorFrom
// [0x00024002] 
struct AAliceGameCrowdAgent_execPickBehaviorFrom_Params
{
	class TArray<struct FBehaviorEntry>                BehaviorList;                                     // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FVector                                     BestCameraLoc;                                    // 0x000C (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class UGameCrowdAgentBehavior*                  SurBehavior;                                      // 0x001C (0x0004) [0x0000000000000000]               
	// class APlayerController*                        PC;                                               // 0x0020 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceGameCrowdAgent.PlayDeathAnimation
// [0x00020902] 
struct AAliceGameCrowdAgent_eventPlayDeathAnimation_Params
{
	// int32_t                                         Index;                                            // 0x0000 (0x0004) [0x0000000000000000]               
	// class UAnimNodeSequence*                        deathAnimSeq;                                     // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceGameCrowdAgent.PlayRunAnimation
// [0x00020902] 
struct AAliceGameCrowdAgent_eventPlayRunAnimation_Params
{
};

// Function AliceGame.AliceGameCrowdAgent.PlayAttackAnimation
// [0x00020902] 
struct AAliceGameCrowdAgent_eventPlayAttackAnimation_Params
{
	// class UAnimNodeSequence*                        AttackAnimSeq;                                    // 0x0000 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceGameCrowdAgent.InitializeAgent
// [0x00020102] 
struct AAliceGameCrowdAgent_execInitializeAgent_Params
{
	class AActor*                                      SpawnLoc;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AGameCrowdAgent*                             AgentTemplate;                                    // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UGameCrowdGroup*                             NewGroup;                                         // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              AgentWarmupTime;                                  // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bWarmupPosition : 1;                              // 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bCheckWarmupVisibility : 1;                       // 0x0014 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function AliceGame.AliceGameCrowdAgent.PostBeginPlay
// [0x00020102] 
struct AAliceGameCrowdAgent_execPostBeginPlay_Params
{
};

// Function AliceGame.AliceGameDropActor.OnAnimEnd
// [0x00020802] 
struct AAliceGameDropActor_eventOnAnimEnd_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayedTime;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ExcessTime;                                       // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEmitterPool.SpawnTemplateExplosionLight
// [0x00024002] 
struct AAliceGameEmitterPool_execSpawnTemplateExplosionLight_Params
{
	struct FAliceExplosionLightTemplate                Template;                                         // 0x0000 (0x0014) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FVector                                     SpawnLocation;                                    // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      AttachToActor;                                    // 0x0020 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UAliceExplosionLight*                        ReturnValue;                                      // 0x0024 (0x0004) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
	// class UAliceExplosionLight*                     Light;                                            // 0x0028 (0x0004) [0x0000000004000000] (CPF_EditInline)
	// int32_t                                         I;                                                // 0x002C (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceGameEmitterPool.SpawnExplosionLight
// [0x00024002] 
struct AAliceGameEmitterPool_execSpawnExplosionLight_Params
{
	class UClass*                                      LightClass;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SpawnLocation;                                    // 0x0004 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      AttachToActor;                                    // 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UAliceExplosionLight*                        ReturnValue;                                      // 0x0014 (0x0004) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
	// class UAliceExplosionLight*                     Light;                                            // 0x0018 (0x0004) [0x0000000004000000] (CPF_EditInline)
	// int32_t                                         I;                                                // 0x001C (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceGameEmitterPool.OnExplosionLightFinished
// [0x00020002] 
struct AAliceGameEmitterPool_execOnExplosionLightFinished_Params
{
	class UAliceExplosionLight*                        Light;                                            // 0x0000 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	// int32_t                                         I;                                                // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceGameEngine.setFinishGameOnHard
// [0x00020002] 
struct UAliceGameEngine_execsetFinishGameOnHard_Params
{
	uint32_t                                           bFinish : 1;                                      // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function AliceGame.AliceGameEngine.isFinishGameOnHard
// [0x00020002] 
struct UAliceGameEngine_execisFinishGameOnHard_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.LaunchAlice1
// [0x00020400]  (iNative[36011])
struct UAliceGameEngine_execLaunchAlice1_Params
{
};

// Function AliceGame.AliceGameEngine.ExecResetKeyBindings
// [0x00020400]  (iNative[33881])
struct UAliceGameEngine_execExecResetKeyBindings_Params
{
};

// Function AliceGame.AliceGameEngine.ExecMouseSpeed
// [0x00020802] 
struct UAliceGameEngine_eventExecMouseSpeed_Params
{
	float                                              fSpeed;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.ExecAttackType
// [0x00020802] 
struct UAliceGameEngine_eventExecAttackType_Params
{
	int32_t                                            nAttackType;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.GetCompatCompositeIndex
// [0x00020400]  (iNative[34544])
struct UAliceGameEngine_execGetCompatCompositeIndex_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.GetAliceKeyIndex
// [0x00420400]  (iNative[34495])
struct UAliceGameEngine_execGetAliceKeyIndex_Params
{
	int32_t                                            Index;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            nKeyType;                                         // 0x0004 (0x0001) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint8_t                                            nKeyGroup;                                        // 0x0005 (0x0001) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.SetAliceKeys
// [0x00020400]  (iNative[39173])
struct UAliceGameEngine_execSetAliceKeys_Params
{
	uint8_t                                            nKeyType;                                         // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            nKeyGroup;                                        // 0x0001 (0x0001) [0x0000000000000080] (CPF_Parm)    
	class FName                                        KeyName;                                          // 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.GetAliceKeys
// [0x00020400]  (iNative[34496])
struct UAliceGameEngine_execGetAliceKeys_Params
{
	uint8_t                                            nKeyType;                                         // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            nKeyGroup;                                        // 0x0001 (0x0001) [0x0000000000000080] (CPF_Parm)    
	class FName                                        ReturnValue;                                      // 0x0004 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.ExecRebindKey
// [0x00420400]  (iNative[33880])
struct UAliceGameEngine_execExecRebindKey_Params
{
	uint8_t                                            nAliceKeyType;                                    // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            nAliceKeyGroup;                                   // 0x0001 (0x0001) [0x0000000000000080] (CPF_Parm)    
	class FName                                        KeyName;                                          // 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class TArray<int32_t>                              RemovedAliceKeys;                                 // 0x000C (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function AliceGame.AliceGameEngine.ExecControlLayout
// [0x00020802] 
struct UAliceGameEngine_eventExecControlLayout_Params
{
	int32_t                                            nControlLayout;                                   // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.ExecGamepadType
// [0x00020800] 
struct UAliceGameEngine_eventExecGamepadType_Params
{
	int32_t                                            iGamepadType;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.ExecDynamicShadows
// [0x00020802] 
struct UAliceGameEngine_eventExecDynamicShadows_Params
{
	uint32_t                                           bEnableDynamicShadow : 1;                         // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class FString                                   Str;                                              // 0x0004 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function AliceGame.AliceGameEngine.ExecPostprocess
// [0x00020802] 
struct UAliceGameEngine_eventExecPostprocess_Params
{
	uint32_t                                           bEnablePostProcess : 1;                           // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function AliceGame.AliceGameEngine.ExecMotionBlur
// [0x00020802] 
struct UAliceGameEngine_eventExecMotionBlur_Params
{
	uint32_t                                           bMotionBlur : 1;                                  // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class FString                                   Str;                                              // 0x0004 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function AliceGame.AliceGameEngine.ExecPhysXLevel
// [0x00020802] 
struct UAliceGameEngine_eventExecPhysXLevel_Params
{
	int32_t                                            iPhysX;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         MaxDestructionChunk;                              // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceGameEngine.ExecStereo3D
// [0x00020802] 
struct UAliceGameEngine_eventExecStereo3D_Params
{
	uint32_t                                           bStereo3D : 1;                                    // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function AliceGame.AliceGameEngine.ExecAntiAlias
// [0x00020802] 
struct UAliceGameEngine_eventExecAntiAlias_Params
{
	uint32_t                                           bAntiAlias : 1;                                   // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class FString                                   Str;                                              // 0x0004 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function AliceGame.AliceGameEngine.ExecScreenResolution
// [0x00020802] 
struct UAliceGameEngine_eventExecScreenResolution_Params
{
	int32_t                                            iResX;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            iResY;                                            // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.ExecGraphicsQuality
// [0x00020802] 
struct UAliceGameEngine_eventExecGraphicsQuality_Params
{
	int32_t                                            iQuality;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class FString                                   Str;                                              // 0x0004 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function AliceGame.AliceGameEngine.ExecGammaConfig
// [0x00020802] 
struct UAliceGameEngine_eventExecGammaConfig_Params
{
	float                                              fGamma;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.ExecSubtitles
// [0x00020802] 
struct UAliceGameEngine_eventExecSubtitles_Params
{
	uint32_t                                           bEnable : 1;                                      // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function AliceGame.AliceGameEngine.ExecVoiceVolume
// [0x00020802] 
struct UAliceGameEngine_eventExecVoiceVolume_Params
{
	float                                              fVolume;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.ExecMusicVolume
// [0x00020802] 
struct UAliceGameEngine_eventExecMusicVolume_Params
{
	float                                              fVolume;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.ExecSoundEffectVolume
// [0x00020802] 
struct UAliceGameEngine_eventExecSoundEffectVolume_Params
{
	float                                              fVolume;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.ExecInvertY
// [0x00020802] 
struct UAliceGameEngine_eventExecInvertY_Params
{
	uint32_t                                           bInvertY : 1;                                     // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function AliceGame.AliceGameEngine.ExecLowestDifficulty
// [0x00020800] 
struct UAliceGameEngine_eventExecLowestDifficulty_Params
{
	int32_t                                            iDifficulty;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.ExecDifficulty
// [0x00020800] 
struct UAliceGameEngine_eventExecDifficulty_Params
{
	int32_t                                            iDifficulty;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.GetDestructionMaxChunkCount
// [0x00020400]  (iNative[34572])
struct UAliceGameEngine_execGetDestructionMaxChunkCount_Params
{
	int32_t                                            nPhysLevel;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      // 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.GetShowPostprocess
// [0x00020400]  (iNative[34706])
struct UAliceGameEngine_execGetShowPostprocess_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.SetNvPhysXLevel
// [0x00020400]  (iNative[39286])
struct UAliceGameEngine_execSetNvPhysXLevel_Params
{
	int32_t                                            nPhysLevel;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.EnableStereo3D
// [0x00020400]  (iNative[33643])
struct UAliceGameEngine_execEnableStereo3D_Params
{
	uint32_t                                           bEnabled : 1;                                     // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function AliceGame.AliceGameEngine.GetSupportedResolutions
// [0x00420400]  (iNative[34726])
struct UAliceGameEngine_execGetSupportedResolutions_Params
{
	int32_t                                            Index;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            iResX;                                            // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            iResY;                                            // 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function AliceGame.AliceGameEngine.GetNumOfSupportedResolutions
// [0x00020400]  (iNative[34668])
struct UAliceGameEngine_execGetNumOfSupportedResolutions_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.DoesSupportMSAA
// [0x00020400]  (iNative[32947])
struct UAliceGameEngine_execDoesSupportMSAA_Params
{
	int32_t                                            MaxMultiSamples;                                  // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.SetSoundVolume
// [0x00020400]  (iNative[39312])
struct UAliceGameEngine_execSetSoundVolume_Params
{
	int32_t                                            SoundType;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              fVol;                                             // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.ExecConfigData
// [0x00020400]  (iNative[33879])
struct UAliceGameEngine_execExecConfigData_Params
{
};

// Function AliceGame.AliceGameEngine.shouldDefaultInvertControls
// [0x00020002] 
struct UAliceGameEngine_execshouldDefaultInvertControls_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// int32_t                                         Settings;                                         // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceGameEngine.shouldShowAutoSaveWarning
// [0x00020002] 
struct UAliceGameEngine_execshouldShowAutoSaveWarning_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.ShowAutoSaveWarning
// [0x00020002] 
struct UAliceGameEngine_execShowAutoSaveWarning_Params
{
};

// Function AliceGame.AliceGameEngine.donotShowAutoSaveWarning
// [0x00020002] 
struct UAliceGameEngine_execdonotShowAutoSaveWarning_Params
{
};

// Function AliceGame.AliceGameEngine.shouldShowStartScreen
// [0x00020002] 
struct UAliceGameEngine_execshouldShowStartScreen_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.ShowStartScreen
// [0x00020002] 
struct UAliceGameEngine_execShowStartScreen_Params
{
};

// Function AliceGame.AliceGameEngine.donotShowStartScreen
// [0x00020002] 
struct UAliceGameEngine_execdonotShowStartScreen_Params
{
};

// Function AliceGame.AliceGameEngine.AreStorageWritesAllowed
// [0x00024802] 
struct UAliceGameEngine_eventAreStorageWritesAllowed_Params
{
	uint32_t                                           bIgnoreDeviceStatus : 1;                          // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            RequiredSize;                                     // 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.IsCurrentDeviceValid
// [0x00024802] 
struct UAliceGameEngine_eventIsCurrentDeviceValid_Params
{
	int32_t                                            SizeNeeded;                                       // 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class UOnlineSubsystem*                         OnlineSub;                                        // 0x0008 (0x0004) [0x0000000000000000]               
	// uint32_t                                        bResult : 1;                                      // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function AliceGame.AliceGameEngine.DeleteCheckpoints
// [0x00484401]  (iNative[32694])
struct UAliceGameEngine_execDeleteCheckpoints_Params
{
	int32_t                                            ResultCode;                                       // 0x0000 (0x0004) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.LoadCheckpoint
// [0x00080401]  (iNative[36126])
struct UAliceGameEngine_execLoadCheckpoint_Params
{
};

// Function AliceGame.AliceGameEngine.SaveCheckpoint
// [0x00080401]  (iNative[39023])
struct UAliceGameEngine_execSaveCheckpoint_Params
{
	struct FVector                                     CheckpointLocation;                               // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameEngine.FindCheckpointData
// [0x00020401]  (iNative[34131])
struct UAliceGameEngine_execFindCheckpointData_Params
{
	int32_t                                            SlotIndex;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.HasStorageDeviceBeenRemoved
// [0x00020401]  (iNative[35104])
struct UAliceGameEngine_execHasStorageDeviceBeenRemoved_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.GetCurrentDeviceID
// [0x00020401]  (iNative[34558])
struct UAliceGameEngine_execGetCurrentDeviceID_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameEngine.SetCurrentDeviceID
// [0x00024401]  (iNative[39203])
struct UAliceGameEngine_execSetCurrentDeviceID_Params
{
	int32_t                                            NewDeviceID;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bProfileSignedOut : 1;                            // 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function AliceGame.AliceGameInfo.NotifyDialogueStart
// [0x00020802] 
struct AAliceGameInfo_eventNotifyDialogueStart_Params
{
	class AActor*                                      Speaker;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      Addressee;                                        // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class USoundCue*                                   Audio;                                            // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            PRI;                                              // 0x000C (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameInfo.NotifyDialogueFinish
// [0x00020802] 
struct AAliceGameInfo_eventNotifyDialogueFinish_Params
{
	class AActor*                                      Speaker;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class USoundCue*                                   Sound;                                            // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameInfo.setLowestGameDifficulty
// [0x00020002] 
struct AAliceGameInfo_execsetLowestGameDifficulty_Params
{
	int32_t                                            I;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameInfo.getLowestGameDifficulty
// [0x00020802] 
struct AAliceGameInfo_eventgetLowestGameDifficulty_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameInfo.setCurrentGameDifficulty
// [0x00020002] 
struct AAliceGameInfo_execsetCurrentGameDifficulty_Params
{
	int32_t                                            I;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameInfo.getCurrentGameDifficulty
// [0x00020802] 
struct AAliceGameInfo_eventgetCurrentGameDifficulty_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function AliceGame.AliceGameInfo.PostApplyPersistentData
// [0x00020800] 
struct AAliceGameInfo_eventPostApplyPersistentData_Params
{
};

// Function AliceGame.AliceGameInfo.PreSavePersistentData
// [0x00020800] 
struct AAliceGameInfo_eventPreSavePersistentData_Params
{
};

// Function AliceGame.AliceGameInfo.GenericPlayerInitialization
// [0x00020002] 
struct AAliceGameInfo_execGenericPlayerInitialization_Params
{
	class AController*                                 C;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class APlayerController*                        PC;                                               // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceGameInfo.CheckpointLoadComplete
// [0x00020802] 
struct AAliceGameInfo_eventCheckpointLoadComplete_Params
{
	// class AAlicePlayerController*                   PC;                                               // 0x0000 (0x0004) [0x0000000000000000]               
};

// Function AliceGame.AliceGameInfo.SpawnDefaultPawnFor
// [0x00820002] 
struct AAliceGameInfo_execSpawnDefaultPawnFor_Params
{
	class AController*                                 NewPlayer;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class ANavigationPoint*                            StartSpot;                                        // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class APawn*                                       ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class UClass*                                   DefaultPlayerClass;                               // 0x000C (0x0004) [0x0000000000000000]               
	// class APawn*                                    ResultPawn;                                       // 0x0010 (0x0004) [0x0000000000000000]               
	// struct FRotator                                 StartRotation;                                    // 0x0014 (0x000C) [0x0000000000000000]               
};

// Function AliceGame.AliceGameInfo.EndLogging
// [0x00020002] 
struct AAliceGameInfo_execEndLogging_Params
{
	class FString                                      Reason;                                           // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function AliceGame.AliceGameInfo.NotifyChangedWeapon
// [0x00020002] 
struct AAliceGameInfo_execNotifyChangedWeapon_Params
{
	class AWeapon*                                     PreviousWeapon;                                   // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AWeapon*                                     NewWeapon;                                        // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameInfo.ShowPickupNewWeaponTip
// [0x00020002] 
struct AAliceGameInfo_execShowPickupNewWeaponTip_Params
{
	class UClass*                                      WeaponClass;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function AliceGame.AliceGameInfo.ShowWeaponUpgradeTip
// [0x00020002] 
struct AAliceGameInfo_execShowWeaponUpgradeTip_Params
{
