/*
#############################################################################################
# Alice2 (ASDK) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.6
# ========================================================================================= #
# File: GameFramework_parameters.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function GameFramework.GameAIController.GetActionString
// [0x00020903] 
struct AGameAIController_eventGetActionString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// class FString                                   ActionStr;                                        // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class UGameAICommand*                           ActiveCmd;                                        // 0x0018 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameAIController.GeneratePathToLocation
// [0x00024800] 
struct AGameAIController_eventGeneratePathToLocation_Params
{
	struct FVector                                     Goal;                                             // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              WithinDistance;                                   // 0x000C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bAllowPartialPath : 1;                            // 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAIController.GeneratePathToActor
// [0x00024800] 
struct AGameAIController_eventGeneratePathToActor_Params
{
	class AActor*                                      Goal;                                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              WithinDistance;                                   // 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bAllowPartialPath : 1;                            // 0x0008 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAIController.SetDesiredRotation
// [0x00024002] 
struct AGameAIController_execSetDesiredRotation_Params
{
	struct FRotator                                    TargetDesiredRotation;                            // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           InLockDesiredRotation : 1;                        // 0x000C (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           InUnlockWhenReached : 1;                          // 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	float                                              InterpolationTime;                                // 0x0014 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GameFramework.GameAIController.AILog_Internal
// [0x00024802] 
struct AGameAIController_eventAILog_Internal_Params
{
	class FString                                      LogText;                                          // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	class FName                                        LogCategory;                                      // 0x000C (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bForce : 1;                                       // 0x0014 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	// int32_t                                         Idx;                                              // 0x0018 (0x0004) [0x0000000000000000]               
	// class FString                                   ActionStr;                                        // 0x001C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                   FinalStr;                                         // 0x0028 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                   Filename;                                         // 0x0034 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class UGameAICommand*                           ActiveCommand;                                    // 0x0040 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameAIController.RecordDemoAILog
// [0x00080000] 
struct AGameAIController_execRecordDemoAILog_Params
{
	class FString                                      LogText;                                          // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
};

// Function GameFramework.GameAIController.Destroyed
// [0x00020802] 
struct AGameAIController_eventDestroyed_Params
{
};

// Function GameFramework.GameAIController.GetAICommandInStack
// [0x00020400]  (iNative[26508])
struct AGameAIController_execGetAICommandInStack_Params
{
	class UClass*                                      InClass;                                          // 0x0000 (0x0004) [0x0000000000000082] (CPF_Const | CPF_Parm)
	class UGameAICommand*                              ReturnValue;                                      // 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAIController.FindCommandOfClass
// [0x00020401]  (iNative[26448])
struct AGameAIController_execFindCommandOfClass_Params
{
	class UClass*                                      SearchClass;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UGameAICommand*                              ReturnValue;                                      // 0x0004 (0x0004) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function GameFramework.GameAIController.DumpCommandStack
// [0x00020401]  (iNative[26407])
struct AGameAIController_execDumpCommandStack_Params
{
};

// Function GameFramework.GameAIController.CheckCommandCount
// [0x00020401]  (iNative[26297])
struct AGameAIController_execCheckCommandCount_Params
{
};

// Function GameFramework.GameAIController.GetActiveCommand
// [0x00020401]  (iNative[26505])
struct AGameAIController_execGetActiveCommand_Params
{
	class UGameAICommand*                              ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAIController.AbortCommand
// [0x00024401]  (iNative[25995])
struct AGameAIController_execAbortCommand_Params
{
	class UGameAICommand*                              AbortCmd;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UClass*                                      AbortClass;                                       // 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAIController.PopCommand
// [0x00020401]  (iNative[26771])
struct AGameAIController_execPopCommand_Params
{
	class UGameAICommand*                              ToBePoppedCommand;                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAIController.PushCommand
// [0x00020401]  (iNative[26799])
struct AGameAIController_execPushCommand_Params
{
	class UGameAICommand*                              NewCommand;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.GetDebugOverheadText
// [0x00420000] 
struct UGameAICommand_execGetDebugOverheadText_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class TArray<class FString>                        OutText;                                          // 0x0004 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function GameFramework.GameAICommand.DrawDebug
// [0x00020800] 
struct UGameAICommand_eventDrawDebug_Params
{
	class AHUD*                                        H;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FName                                        Category;                                         // 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.GetDumpString
// [0x00020802] 
struct UGameAICommand_eventGetDumpString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function GameFramework.GameAICommand.Resumed
// [0x00020002] 
struct UGameAICommand_execResumed_Params
{
	class FName                                        OldCommandName;                                   // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.Paused
// [0x00020002] 
struct UGameAICommand_execPaused_Params
{
	class UGameAICommand*                              NewCommand;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.Popped
// [0x00020002] 
struct UGameAICommand_execPopped_Params
{
};

// Function GameFramework.GameAICommand.Pushed
// [0x00020002] 
struct UGameAICommand_execPushed_Params
{
};

// Function GameFramework.GameAICommand.PostPopped
// [0x00020000] 
struct UGameAICommand_execPostPopped_Params
{
};

// Function GameFramework.GameAICommand.PrePushed
// [0x00020000] 
struct UGameAICommand_execPrePushed_Params
{
	class AGameAIController*                           AI;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.AllowStateTransitionTo
// [0x00020002] 
struct UGameAICommand_execAllowStateTransitionTo_Params
{
	class FName                                        StateName;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAICommand.AllowTransitionTo
// [0x00020002] 
struct UGameAICommand_execAllowTransitionTo_Params
{
	class UClass*                                      AttemptCommand;                                   // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAICommand.Tick
// [0x00020000] 
struct UGameAICommand_execTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.ShouldIgnoreNotifies
// [0x00020401]  (iNative[26903])
struct UGameAICommand_execShouldIgnoreNotifies_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameAICommand.InternalTick
// [0x00020803] 
struct UGameAICommand_eventInternalTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.InternalResumed
// [0x00020803] 
struct UGameAICommand_eventInternalResumed_Params
{
	class FName                                        OldCommandName;                                   // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.InternalPaused
// [0x00020803] 
struct UGameAICommand_eventInternalPaused_Params
{
	class UGameAICommand*                              NewCommand;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.InternalPopped
// [0x00020802] 
struct UGameAICommand_eventInternalPopped_Params
{
};

// Function GameFramework.GameAICommand.InternalPushed
// [0x00020803] 
struct UGameAICommand_eventInternalPushed_Params
{
};

// Function GameFramework.GameAICommand.InternalPrePushed
// [0x00020803] 
struct UGameAICommand_eventInternalPrePushed_Params
{
	class AGameAIController*                           AI;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameAICommand.InitCommand
// [0x00022002] 
struct UGameAICommand_execInitCommand_Params
{
	class AGameAIController*                           AI;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class UGameAICommand*                           Cmd;                                              // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameAICommand.InitCommandUserActor
// [0x00022002] 
struct UGameAICommand_execInitCommandUserActor_Params
{
	class AGameAIController*                           AI;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      UserActor;                                        // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdAgent.GetBehaviorString
// [0x00020002] 
struct AGameCrowdAgent_execGetBehaviorString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// class FString                                   BehaviorString;                                   // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function GameFramework.GameCrowdAgent.GetDestString
// [0x00020002] 
struct AGameCrowdAgent_execGetDestString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// class FString                                   DestString;                                       // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function GameFramework.GameCrowdAgent.PostRenderFor
// [0x00820902] 
struct AGameCrowdAgent_eventPostRenderFor_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UCanvas*                                     Canvas;                                           // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraPosition;                                   // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraDir;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	// float                                           NameXL;                                           // 0x0020 (0x0004) [0x0000000000000000]               
	// float                                           TextXL;                                           // 0x0024 (0x0004) [0x0000000000000000]               
	// float                                           BehavXL;                                          // 0x0028 (0x0004) [0x0000000000000000]               
	// float                                           TextYL;                                           // 0x002C (0x0004) [0x0000000000000000]               
	// float                                           YL;                                               // 0x0030 (0x0004) [0x0000000000000000]               
	// float                                           XL;                                               // 0x0034 (0x0004) [0x0000000000000000]               
	// struct FVector                                  ScreenLoc;                                        // 0x0038 (0x000C) [0x0000000000000000]               
	// class FString                                   ScreenName;                                       // 0x0044 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                   DestString;                                       // 0x0050 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class FString                                   BehaviorString;                                   // 0x005C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// struct FFontRenderInfo                          FontInfo;                                         // 0x0068 (0x0028) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.NativePostRenderFor
// [0x00020500]  (iNative[18188])
struct AGameCrowdAgent_execNativePostRenderFor_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UCanvas*                                     Canvas;                                           // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraPosition;                                   // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraDir;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.GeneratePathToActor
// [0x00824802] 
struct AGameCrowdAgent_eventGeneratePathToActor_Params
{
	class AActor*                                      Goal;                                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              WithinDistance;                                   // 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bAllowPartialPath : 1;                            // 0x0008 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     ReturnValue;                                      // 0x000C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  NextDest;                                         // 0x0018 (0x000C) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.InitNavigationHandle
// [0x00020802] 
struct AGameCrowdAgent_eventInitNavigationHandle_Params
{
};

// Function GameFramework.GameCrowdAgent.OverlappedActorEvent
// [0x00020800] 
struct AGameCrowdAgent_eventOverlappedActorEvent_Params
{
	class AActor*                                      A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.TakeDamage
// [0x00024002] 
struct AGameCrowdAgent_execTakeDamage_Params
{
	int32_t                                            DamageAmount;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 EventInstigator;                                  // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Momentum;                                         // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UClass*                                      DamageType;                                       // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               HitInfo;                                          // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      DamageCauser;                                     // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GameFramework.GameCrowdAgent.FireDeathEvent
// [0x00020902] 
struct AGameCrowdAgent_eventFireDeathEvent_Params
{
};

// Function GameFramework.GameCrowdAgent.PlayDeath
// [0x00020400]  (iNative[26761])
struct AGameCrowdAgent_execPlayDeath_Params
{
	struct FVector                                     KillMomentum;                                     // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.UpdateIntermediatePoint
// [0x00024802] 
struct AGameCrowdAgent_eventUpdateIntermediatePoint_Params
{
	class AActor*                                      DestinationActor;                                 // 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GameFramework.GameCrowdAgent.CalcCamera
// [0x00C20102] 
struct AGameCrowdAgent_execCalcCamera_Params
{
	float                                              fDeltaTime;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     out_CamLoc;                                       // 0x0004 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FRotator                                    out_CamRot;                                       // 0x0010 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              out_FOV;                                          // 0x001C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  // 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  HitNormal;                                        // 0x0024 (0x000C) [0x0000000000000000]               
	// float                                           Radius;                                           // 0x0030 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.IsIdle
// [0x00020400]  (iNative[26579])
struct AGameCrowdAgent_execIsIdle_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdAgent.SetCurrentBehavior
// [0x00020401]  (iNative[26884])
struct AGameCrowdAgent_execSetCurrentBehavior_Params
{
	class UGameCrowdAgentBehavior*                     BehaviorArchetype;                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.StopBehavior
// [0x00020802] 
struct AGameCrowdAgent_eventStopBehavior_Params
{
};

// Function GameFramework.GameCrowdAgent.ActivateInstancedBehavior
// [0x00020002] 
struct AGameCrowdAgent_execActivateInstancedBehavior_Params
{
	class UGameCrowdAgentBehavior*                     NewBehaviorObject;                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.ActivateBehavior
// [0x00020802] 
struct AGameCrowdAgent_eventActivateBehavior_Params
{
	class UGameCrowdAgentBehavior*                     NewBehaviorArchetype;                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.ResetSeePlayer
// [0x00020002] 
struct AGameCrowdAgent_execResetSeePlayer_Params
{
};

// Function GameFramework.GameCrowdAgent.TryRandomBehavior
// [0x00020002] 
struct AGameCrowdAgent_execTryRandomBehavior_Params
{
	// uint32_t                                        bFoundBehavior : 1;                               // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	// int32_t                                         I;                                                // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.NotifySeePlayer
// [0x00020802] 
struct AGameCrowdAgent_eventNotifySeePlayer_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// uint32_t                                        bFoundBehavior : 1;                               // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	// int32_t                                         I;                                                // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.PlaySpawnBehavior
// [0x00020002] 
struct AGameCrowdAgent_execPlaySpawnBehavior_Params
{
};

// Function GameFramework.GameCrowdAgent.HandlePotentialAgentEncounter
// [0x00020802] 
struct AGameCrowdAgent_eventHandlePotentialAgentEncounter_Params
{
};

// Function GameFramework.GameCrowdAgent.StopIdleAnimation
// [0x00020900] 
struct AGameCrowdAgent_eventStopIdleAnimation_Params
{
};

// Function GameFramework.GameCrowdAgent.PlayIdleAnimation
// [0x00020900] 
struct AGameCrowdAgent_eventPlayIdleAnimation_Params
{
};

// Function GameFramework.GameCrowdAgent.OnPlayAgentAnimation
// [0x00020102] 
struct AGameCrowdAgent_execOnPlayAgentAnimation_Params
{
	class USeqAct_PlayAgentAnimation*                  Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.InitializeAgent
// [0x00820102] 
struct AGameCrowdAgent_execInitializeAgent_Params
{
	class AActor*                                      SpawnLoc;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AGameCrowdAgent*                             AgentTemplate;                                    // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UGameCrowdGroup*                             NewGroup;                                         // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              AgentWarmupTime;                                  // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bWarmupPosition : 1;                              // 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bCheckWarmupVisibility : 1;                       // 0x0014 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// uint32_t                                        bGroupDestination : 1;                            // 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	// uint32_t                                        bRealPreferVisible : 1;                           // 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	// class AGameCrowdDestination*                    SpawnDest;                                        // 0x0020 (0x0004) [0x0000000000000000]               
	// float                                           TryPct;                                           // 0x0024 (0x0004) [0x0000000000000000]               
	// float                                           MaxSpawnDist;                                     // 0x0028 (0x0004) [0x0000000000000000]               
	// float                                           DestDist;                                         // 0x002C (0x0004) [0x0000000000000000]               
	// float                                           StartDist;                                        // 0x0030 (0x0004) [0x0000000000000000]               
	// struct FVector                                  TryLoc;                                           // 0x0034 (0x000C) [0x0000000000000000]               
	// class AActor*                                   HitActor;                                         // 0x0040 (0x0004) [0x0000000000000000]               
	// struct FVector                                  HitLocation;                                      // 0x0044 (0x000C) [0x0000000000000000]               
	// struct FVector                                  HitNormal;                                        // 0x0050 (0x000C) [0x0000000000000000]               
	// struct FVector                                  ViewLocation;                                     // 0x005C (0x000C) [0x0000000000000000]               
	// struct FVector                                  YAdjust;                                          // 0x0068 (0x000C) [0x0000000000000000]               
	// struct FRotator                                 ViewRotation;                                     // 0x0074 (0x000C) [0x0000000000000000]               
	// class APlayerController*                        PC;                                               // 0x0080 (0x0004) [0x0000000000000000]               
	// uint32_t                                        bVisibleTryLoc : 1;                               // 0x0084 (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameCrowdAgent.SetLighting
// [0x00020102] 
struct AGameCrowdAgent_execSetLighting_Params
{
	uint32_t                                           bEnableLightEnvironment : 1;                      // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	struct FLightingChannelContainer                   AgentLightingChannel;                             // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bCastShadows : 1;                                 // 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function GameFramework.GameCrowdAgent.DisplayDebug
// [0x00420102] 
struct AGameCrowdAgent_execDisplayDebug_Params
{
	class AHUD*                                        HUD;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              out_YL;                                           // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              out_YPos;                                         // 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	// class FString                                   T;                                                // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	// class UCanvas*                                  Canvas;                                           // 0x0018 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.Destroyed
// [0x00020102] 
struct AGameCrowdAgent_execDestroyed_Params
{
};

// Function GameFramework.GameCrowdAgent.ResetPooledAgent
// [0x00020002] 
struct AGameCrowdAgent_execResetPooledAgent_Params
{
};

// Function GameFramework.GameCrowdAgent.KillAgent
// [0x00020802] 
struct AGameCrowdAgent_eventKillAgent_Params
{
};

// Function GameFramework.GameCrowdAgent.PostBeginPlay
// [0x00820102] 
struct AGameCrowdAgent_execPostBeginPlay_Params
{
	// struct FVector                                  AgentScale3D;                                     // 0x0000 (0x000C) [0x0000000000000000]               
	// int32_t                                         I;                                                // 0x000C (0x0004) [0x0000000000000000]               
	// float                                           MaxSeePlayerDist;                                 // 0x0010 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.SetMaxSpeed
// [0x00020002] 
struct AGameCrowdAgent_execSetMaxSpeed_Params
{
};

// Function GameFramework.GameCrowdAgent.SetCurrentDestination
// [0x00020802] 
struct AGameCrowdAgent_eventSetCurrentDestination_Params
{
	class AGameCrowdDestination*                       NewDest;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgent.WaitForGroupMembers
// [0x00020802] 
struct AGameCrowdAgent_eventWaitForGroupMembers_Params
{
	// int32_t                                         I;                                                // 0x0000 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.PickBehaviorFrom
// [0x00824002] 
struct AGameCrowdAgent_execPickBehaviorFrom_Params
{
	class TArray<struct FBehaviorEntry>                BehaviorList;                                     // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FVector                                     BestCameraLoc;                                    // 0x000C (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FVector                                  cameraLoc;                                        // 0x001C (0x000C) [0x0000000000000000]               
	// struct FRotator                                 cameraRot;                                        // 0x0028 (0x000C) [0x0000000000000000]               
	// class APlayerController*                        PC;                                               // 0x0034 (0x0004) [0x0000000000000000]               
	// float                                           BestDistSq;                                       // 0x0038 (0x0004) [0x0000000000000000]               
	// float                                           NewDistSq;                                        // 0x003C (0x0004) [0x0000000000000000]               
	// int32_t                                         I;                                                // 0x0040 (0x0004) [0x0000000000000000]               
	// float                                           FreqSum;                                          // 0x0044 (0x0004) [0x0000000000000000]               
	// float                                           RandPick;                                         // 0x0048 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdAgent.SetPanic
// [0x00020002] 
struct AGameCrowdAgent_execSetPanic_Params
{
	class AActor*                                      PanicActor;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bNewPanic : 1;                                    // 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function GameFramework.GameCrowdAgent.IsPanicked
// [0x00020400]  (iNative[26581])
struct AGameCrowdAgent_execIsPanicked_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdAgent.FellOutOfWorld
// [0x00020902] 
struct AGameCrowdAgent_eventFellOutOfWorld_Params
{
	class UClass*                                      dmgType;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentSkeletal.CreateAttachments
// [0x00020102] 
struct AGameCrowdAgentSkeletal_execCreateAttachments_Params
{
	// int32_t                                         AttachIdx;                                        // 0x0000 (0x0004) [0x0000000000000000]               
	// int32_t                                         InfoIdx;                                          // 0x0004 (0x0004) [0x0000000000000000]               
	// int32_t                                         PickedInfoIdx;                                    // 0x0008 (0x0004) [0x0000000000000000]               
	// float                                           ChanceTotal;                                      // 0x000C (0x0004) [0x0000000000000000]               
	// float                                           RandVal;                                          // 0x0010 (0x0004) [0x0000000000000000]               
	// class UStaticMeshComponent*                     StaticMeshComp;                                   // 0x0014 (0x0004) [0x0000000004000000] (CPF_EditInline)
	// uint32_t                                        bUseSocket : 1;                                   // 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	// uint32_t                                        bUseBone : 1;                                     // 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function GameFramework.GameCrowdAgentSkeletal.OnAnimEnd
// [0x00020802] 
struct AGameCrowdAgentSkeletal_eventOnAnimEnd_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayedTime;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ExcessTime;                                       // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentSkeletal.StopIdleAnimation
// [0x00020902] 
struct AGameCrowdAgentSkeletal_eventStopIdleAnimation_Params
{
};

// Function GameFramework.GameCrowdAgentSkeletal.PlayIdleAnimation
// [0x00020902] 
struct AGameCrowdAgentSkeletal_eventPlayIdleAnimation_Params
{
};

// Function GameFramework.GameCrowdAgentSkeletal.ClearLatentAnimation
// [0x00020802] 
struct AGameCrowdAgentSkeletal_eventClearLatentAnimation_Params
{
};

// Function GameFramework.GameCrowdAgentSkeletal.OnPlayAgentAnimation
// [0x00020102] 
struct AGameCrowdAgentSkeletal_execOnPlayAgentAnimation_Params
{
	class USeqAct_PlayAgentAnimation*                  Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentSkeletal.SetRootMotion
// [0x00020400]  (iNative[26893])
struct AGameCrowdAgentSkeletal_execSetRootMotion_Params
{
	uint32_t                                           bRootMotionEnabled : 1;                           // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function GameFramework.GameCrowdAgentSkeletal.PlayDeath
// [0x00020400]  (iNative[26761])
struct AGameCrowdAgentSkeletal_execPlayDeath_Params
{
	struct FVector                                     KillMomentum;                                     // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentSkeletal.SetLighting
// [0x00020102] 
struct AGameCrowdAgentSkeletal_execSetLighting_Params
{
	uint32_t                                           bEnableLightEnvironment : 1;                      // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	struct FLightingChannelContainer                   AgentLightingChannel;                             // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bCastShadows : 1;                                 // 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function GameFramework.GameCrowdAgentSkeletal.PostBeginPlay
// [0x00020102] 
struct AGameCrowdAgentSkeletal_execPostBeginPlay_Params
{
};

// Function GameFramework.GameCrowdAgentBehavior.AllowBehaviorAt
// [0x00020002] 
struct UGameCrowdAgentBehavior_execAllowBehaviorAt_Params
{
	class AGameCrowdDestination*                       Destination;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdAgentBehavior.AllowThisDestination
// [0x00020002] 
struct UGameCrowdAgentBehavior_execAllowThisDestination_Params
{
	class AGameCrowdDestination*                       Destination;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdAgentBehavior.PropagateViralBehaviorTo
// [0x00020800] 
struct UGameCrowdAgentBehavior_eventPropagateViralBehaviorTo_Params
{
	class AGameCrowdAgent*                             OtherAgent;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentBehavior.ActivatedBy
// [0x00020002] 
struct UGameCrowdAgentBehavior_execActivatedBy_Params
{
	class AActor*                                      NewActionTarget;                                  // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentBehavior.GetDestinationActor
// [0x00020002] 
struct UGameCrowdAgentBehavior_execGetDestinationActor_Params
{
	class AActor*                                      ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdAgentBehavior.ChangingDestination
// [0x00020000] 
struct UGameCrowdAgentBehavior_execChangingDestination_Params
{
	class AGameCrowdDestination*                       NewDest;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentBehavior.GetBehaviorString
// [0x00020002] 
struct UGameCrowdAgentBehavior_execGetBehaviorString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function GameFramework.GameCrowdAgentBehavior.OnAnimEnd
// [0x00020800] 
struct UGameCrowdAgentBehavior_eventOnAnimEnd_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayedTime;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ExcessTime;                                       // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentBehavior.StopBehavior
// [0x00020000] 
struct UGameCrowdAgentBehavior_execStopBehavior_Params
{
};

// Function GameFramework.GameCrowdAgentBehavior.InitBehavior
// [0x00020002] 
struct UGameCrowdAgentBehavior_execInitBehavior_Params
{
	class AGameCrowdAgent*                             Agent;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentBehavior.HandleMovement
// [0x00020400]  (iNative[26534])
struct UGameCrowdAgentBehavior_execHandleMovement_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdAgentBehavior.FinishedTargetRotation
// [0x00020800] 
struct UGameCrowdAgentBehavior_eventFinishedTargetRotation_Params
{
};

// Function GameFramework.GameCrowdAgentBehavior.CanBeUsedBy
// [0x00020002] 
struct UGameCrowdAgentBehavior_execCanBeUsedBy_Params
{
	class AGameCrowdAgent*                             Agent;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     cameraLoc;                                        // 0x0004 (0x000C) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdAgentBehavior.Tick
// [0x00020400]  (iNative[336])
struct UGameCrowdAgentBehavior_execTick_Params
{
	float                                              DeltaTime;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdAgentBehavior.ShouldEndIdle
// [0x00020400]  (iNative[26900])
struct UGameCrowdAgentBehavior_execShouldEndIdle_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdBehavior_PlayAnimation.GetBehaviorString
// [0x00020002] 
struct UGameCrowdBehavior_PlayAnimation_execGetBehaviorString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// class FString                                   BehaviorString;                                   // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function GameFramework.GameCrowdBehavior_PlayAnimation.StopBehavior
// [0x00020002] 
struct UGameCrowdBehavior_PlayAnimation_execStopBehavior_Params
{
};

// Function GameFramework.GameCrowdBehavior_PlayAnimation.PlayAgentAnimationNow
// [0x00020002] 
struct UGameCrowdBehavior_PlayAnimation_execPlayAgentAnimationNow_Params
{
	// float                                           CurrentBlendInTime;                               // 0x0000 (0x0004) [0x0000000000000000]               
	// float                                           CurrentBlendOutTime;                              // 0x0004 (0x0004) [0x0000000000000000]               
	// class AGameCrowdAgentSkeletal*                  MySkAgent;                                        // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdBehavior_PlayAnimation.OnAnimEnd
// [0x00020802] 
struct UGameCrowdBehavior_PlayAnimation_eventOnAnimEnd_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayedTime;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ExcessTime;                                       // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdBehavior_PlayAnimation.SetSequenceOutput
// [0x00020400]  (iNative[26894])
struct UGameCrowdBehavior_PlayAnimation_execSetSequenceOutput_Params
{
};

// Function GameFramework.GameCrowdBehavior_PlayAnimation.FinishedTargetRotation
// [0x00020802] 
struct UGameCrowdBehavior_PlayAnimation_eventFinishedTargetRotation_Params
{
};

// Function GameFramework.GameCrowdBehavior_PlayAnimation.InitBehavior
// [0x00020002] 
struct UGameCrowdBehavior_PlayAnimation_execInitBehavior_Params
{
	class AGameCrowdAgent*                             Agent;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class APlayerController*                        PC;                                               // 0x0004 (0x0004) [0x0000000000000000]               
	// class APlayerController*                        ClosestPC;                                        // 0x0008 (0x0004) [0x0000000000000000]               
	// float                                           ClosestDist;                                      // 0x000C (0x0004) [0x0000000000000000]               
	// float                                           newdist;                                          // 0x0010 (0x0004) [0x0000000000000000]               
	// class AGameCrowdAgentSkeletal*                  SkAgent;                                          // 0x0014 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdBehavior_RunFromPanic.GetBehaviorString
// [0x00020002] 
struct UGameCrowdBehavior_RunFromPanic_execGetBehaviorString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function GameFramework.GameCrowdBehavior_RunFromPanic.AllowBehaviorAt
// [0x00020002] 
struct UGameCrowdBehavior_RunFromPanic_execAllowBehaviorAt_Params
{
	class AGameCrowdDestination*                       Destination;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdBehavior_RunFromPanic.AllowThisDestination
// [0x00020002] 
struct UGameCrowdBehavior_RunFromPanic_execAllowThisDestination_Params
{
	class AGameCrowdDestination*                       Destination;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdBehavior_RunFromPanic.PropagateViralBehaviorTo
// [0x00020802] 
struct UGameCrowdBehavior_RunFromPanic_eventPropagateViralBehaviorTo_Params
{
	class AGameCrowdAgent*                             OtherAgent;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdBehavior_RunFromPanic.StopBehavior
// [0x00020002] 
struct UGameCrowdBehavior_RunFromPanic_execStopBehavior_Params
{
};

// Function GameFramework.GameCrowdBehavior_RunFromPanic.InitBehavior
// [0x00020002] 
struct UGameCrowdBehavior_RunFromPanic_execInitBehavior_Params
{
	class AGameCrowdAgent*                             Agent;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdBehavior_RunFromPanic.ActivatedBy
// [0x00020002] 
struct UGameCrowdBehavior_RunFromPanic_execActivatedBy_Params
{
	class AActor*                                      NewActionTarget;                                  // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// class AGameCrowdDestination*                    TempDest;                                         // 0x0004 (0x0004) [0x0000000000000000]               
	// class AGameCrowdDestination*                    PrevDest;                                         // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdBehavior_WaitForGroup.StopBehavior
// [0x00020002] 
struct UGameCrowdBehavior_WaitForGroup_execStopBehavior_Params
{
};

// Function GameFramework.GameCrowdBehavior_WaitForGroup.ShouldEndIdle
// [0x00020400]  (iNative[26900])
struct UGameCrowdBehavior_WaitForGroup_execShouldEndIdle_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdBehavior_WaitForGroup.GetBehaviorString
// [0x00020002] 
struct UGameCrowdBehavior_WaitForGroup_execGetBehaviorString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// class FString                                   BehaviorString;                                   // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function GameFramework.GameCrowdBehavior_WaitForGroup.InitBehavior
// [0x00020002] 
struct UGameCrowdBehavior_WaitForGroup_execInitBehavior_Params
{
	class AGameCrowdAgent*                             Agent;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdBehavior_WaitInQueue.StopBehavior
// [0x00020002] 
struct UGameCrowdBehavior_WaitInQueue_execStopBehavior_Params
{
};

// Function GameFramework.GameCrowdBehavior_WaitInQueue.ShouldEndIdle
// [0x00020400]  (iNative[26900])
struct UGameCrowdBehavior_WaitInQueue_execShouldEndIdle_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdBehavior_WaitInQueue.GetBehaviorString
// [0x00020002] 
struct UGameCrowdBehavior_WaitInQueue_execGetBehaviorString_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function GameFramework.GameCrowdBehavior_WaitInQueue.GetDestinationActor
// [0x00020002] 
struct UGameCrowdBehavior_WaitInQueue_execGetDestinationActor_Params
{
	class AActor*                                      ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdBehavior_WaitInQueue.ChangingDestination
// [0x00020002] 
struct UGameCrowdBehavior_WaitInQueue_execChangingDestination_Params
{
	class AGameCrowdDestination*                       NewDest;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdBehavior_WaitInQueue.HandleMovement
// [0x00020400]  (iNative[26534])
struct UGameCrowdBehavior_WaitInQueue_execHandleMovement_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GameFramework.GameCrowdGroup.UpdateDestinations
// [0x00020002] 
struct UGameCrowdGroup_execUpdateDestinations_Params
{
	class AGameCrowdDestination*                       NewDestination;                                   // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         I;                                                // 0x0004 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdGroup.RemoveMember
// [0x00020002] 
struct UGameCrowdGroup_execRemoveMember_Params
{
	class AGameCrowdAgent*                             Agent;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdGroup.AddMember
// [0x00020002] 
struct UGameCrowdGroup_execAddMember_Params
{
	class AGameCrowdAgent*                             Agent;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdInteractionPoint.OnToggle
// [0x00020002] 
struct AGameCrowdInteractionPoint_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GameFramework.GameCrowdDestination.GetSpawnPosition
// [0x00C20102] 
struct AGameCrowdDestination_execGetSpawnPosition_Params
{
	class USeqAct_GameCrowdSpawner*                    Spawner;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SpawnPos;                                         // 0x0004 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FRotator                                    SpawnRot;                                         // 0x0010 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	// struct FVector                                  SpawnLine;                                        // 0x001C (0x000C) [0x0000000000000000]               
	// float                                           RandScale;                                        // 0x0028 (0x0004) [0x0000000000000000]               
};

// Function GameFramework.GameCrowdDestination.AllowableDestinationFor
// [0x00020902] 
struct AGameCrowdDestination_eventAllowableDestinationFor_Params
{
	class AGameCrowdAgent*                             Agent;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// int32_t                                         I;                                                // 0x0008 (0x0004) [0x0000000000000000]               
