/*
#############################################################################################
# Alice2 (ASDK) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.6
# ========================================================================================= #
# File: GameFramework_classes.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

// Forward Declarations
class UClass;
class UFunction;
class UProperty;
class UStructProperty;
class UStruct;


/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_LOADING_MOVIE                                         "LoadingMovie"

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum GameFramework.GameCrowdAgent.EConformType
enum class EConformType : uint8_t
{
	CFM_NavMesh                                        = 0,
	CFM_BSP                                            = 1,
	CFM_World                                          = 2,
	CFM_None                                           = 3,
	CFM_END                                            = 4
};

// Enum GameFramework.GameTypes.EShakeParam
enum class EShakeParam : uint8_t
{
	ESP_OffsetRandom                                   = 0,
	ESP_OffsetZero                                     = 1,
	ESP_END                                            = 2
};

// Enum GameFramework.GameSkelCtrl_Recoil.ERecoilStart
enum class ERecoilStart : uint8_t
{
	ERS_Zero                                           = 0,
	ERS_Random                                         = 1,
	ERS_END                                            = 2
};

// Enum GameFramework.GameThirdPersonCameraMode.ECameraViewportTypes
enum class ECameraViewportTypes : uint8_t
{
	CVT_16to9_Full                                     = 0,
	CVT_16to9_VertSplit                                = 1,
	CVT_16to9_HorizSplit                               = 2,
	CVT_4to3_Full                                      = 3,
	CVT_4to3_HorizSplit                                = 4,
	CVT_4to3_VertSplit                                 = 5,
	CVT_END                                            = 6
};

// Enum GameFramework.MobileHUD.EZoneType
enum class EZoneType : uint8_t
{
	ZoneType_Button                                    = 0,
	ZoneType_Joystick                                  = 1,
	ZoneType_Trackball                                 = 2,
	ZoneType_Tilt                                      = 3,
	ZoneType_END                                       = 4
};

// Enum GameFramework.MobileHUD.EZoneState
enum class EZoneState : uint8_t
{
	ZoneState_Inactive                                 = 0,
	ZoneState_Activating                               = 1,
	ZoneState_Active                                   = 2,
	ZoneState_Deactivating                             = 3,
	ZoneState_END                                      = 4
};


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class GameFramework.GameAIController
// 0x0024 (0x03DC - 0x0400)
class AGameAIController : public AAIController
{
public:
	class UGameAICommand*                              CommandList;                                   // 0x03DC (0x0004) [0x0000000000002002] (CPF_Const | CPF_Transient)
	uint32_t                                           bHasRunawayCommandList : 1;                    // 0x03E0 (0x0004) [0x0000000000002000] [0x00000001] (CPF_Transient)
	uint32_t                                           bAILogging : 1;                                // 0x03E0 (0x0004) [0x0000000000004001] [0x00000002] (CPF_Edit | CPF_Config)
	uint32_t                                           bAILogToWindow : 1;                            // 0x03E0 (0x0004) [0x0000000000004001] [0x00000004] (CPF_Edit | CPF_Config)
	uint32_t                                           bFlushAILogEachLine : 1;                       // 0x03E0 (0x0004) [0x0000000000004001] [0x00000008] (CPF_Edit | CPF_Config)
	uint32_t                                           bMapBasedLogName : 1;                          // 0x03E0 (0x0004) [0x0000000000004001] [0x00000010] (CPF_Edit | CPF_Config)
	uint32_t                                           bAIDrawDebug : 1;                              // 0x03E0 (0x0004) [0x0000000000004001] [0x00000020] (CPF_Edit | CPF_Config)
	uint32_t                                           bAIBroken : 1;                                 // 0x03E0 (0x0004) [0x0000000000002000] [0x00000040] (CPF_Transient)
	class AFileLog*                                    AILogFile;                                     // 0x03E4 (0x0004) [0x0000000000002000] (CPF_Transient)
	class TArray<class FName>                          AILogFilter;                                   // 0x03E8 (0x000C) [0x0000000000404001] (CPF_Edit | CPF_Config | CPF_NeedCtorLink)
	class FString                                      DemoActionString;                              // 0x03F4 (0x000C) [0x0000000000400020] (CPF_Net | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameAIController");
		}

		return uClassPointer;
	};

	class FString eventGetActionString();
	bool eventGeneratePathToLocation(const struct FVector& Goal, float optionalWithinDistance, bool optionalBAllowPartialPath);
	bool eventGeneratePathToActor(class AActor* Goal, float optionalWithinDistance, bool optionalBAllowPartialPath);
	void SetDesiredRotation(const struct FRotator& TargetDesiredRotation, bool optionalInLockDesiredRotation, bool optionalInUnlockWhenReached, float optionalInterpolationTime);
	void eventAILog_Internal(const class FString& LogText, const class FName& optionalLogCategory, bool optionalBForce);
	void RecordDemoAILog(const class FString& LogText);
	void eventDestroyed();
	class UGameAICommand* GetAICommandInStack(class UClass* InClass);
	class UGameAICommand* FindCommandOfClass(class UClass* SearchClass);
	void DumpCommandStack();
	void CheckCommandCount();
	class UGameAICommand* GetActiveCommand();
	bool AbortCommand(class UGameAICommand* AbortCmd, class UClass* optionalAbortClass);
	void PopCommand(class UGameAICommand* ToBePoppedCommand);
	void PushCommand(class UGameAICommand* NewCommand);
};

// Class GameFramework.GameAICommand
// 0x001C (0x003C - 0x0058)
class UGameAICommand : public UObject
{
public:
	class UGameAICommand*                              ChildCommand;                                  // 0x003C (0x0004) [0x0000000000002002] (CPF_Const | CPF_Transient)
	class FName                                        ChildStatus;                                   // 0x0040 (0x0008) [0x0000000000002002] (CPF_Const | CPF_Transient)
	class AGameAIController*                           GameAIOwner;                                   // 0x0048 (0x0004) [0x0000000000002000] (CPF_Transient)
	class FName                                        Status;                                        // 0x004C (0x0008) [0x0000000000002000] (CPF_Transient)
	uint32_t                                           bAllowNewSameClassInstance : 1;                // 0x0054 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bReplaceActiveSameClassInstance : 1;           // 0x0054 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bAborted : 1;                                  // 0x0054 (0x0004) [0x0000000000002000] [0x00000004] (CPF_Transient)
	uint32_t                                           bIgnoreNotifies : 1;                           // 0x0054 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bPendingPop : 1;                               // 0x0054 (0x0004) [0x0000000000002000] [0x00000010] (CPF_Transient)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameAICommand");
		}

		return uClassPointer;
	};

	void GetDebugOverheadText(class APlayerController* PC, class TArray<class FString>& outOutText);
	void eventDrawDebug(class AHUD* H, const class FName& Category);
	class FString eventGetDumpString();
	void Resumed(const class FName& OldCommandName);
	void Paused(class UGameAICommand* NewCommand);
	void Popped();
	void Pushed();
	void PostPopped();
	void PrePushed(class AGameAIController* AI);
	bool AllowStateTransitionTo(const class FName& StateName);
	bool AllowTransitionTo(class UClass* AttemptCommand);
	void Tick(float DeltaTime);
	bool ShouldIgnoreNotifies();
	void eventInternalTick(float DeltaTime);
	void eventInternalResumed(const class FName& OldCommandName);
	void eventInternalPaused(class UGameAICommand* NewCommand);
	void eventInternalPopped();
	void eventInternalPushed();
	void eventInternalPrePushed(class AGameAIController* AI);
	static bool InitCommand(class AGameAIController* AI);
	static bool InitCommandUserActor(class AGameAIController* AI, class AActor* UserActor);
};

// Class GameFramework.GameCameraBlockingVolume
// 0x0000 (0x0268 - 0x0268)
class AGameCameraBlockingVolume : public ABlockingVolume
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCameraBlockingVolume");
		}

		return uClassPointer;
	};

};

// Class GameFramework.GameCrowdAgent
// 0x01D8 (0x022C - 0x0404)
class AGameCrowdAgent : public ACrowdAgentBase
{
public:
	class UGameCrowdGroup*                             MyGroup;                                       // 0x022C (0x0004) [0x0000000000000000]               
	struct FVector                                     PreferredVelocity;                             // 0x0230 (0x000C) [0x0000000000000000]               
	float                                              AvoidanceShare;                                // 0x023C (0x0004) [0x0000000000000000]               
	class AGameCrowdDestination*                       CurrentDestination;                            // 0x0240 (0x0004) [0x0000000000000000]               
	class AGameCrowdDestination*                       BehaviorDestination;                           // 0x0244 (0x0004) [0x0000000000000000]               
	class AGameCrowdDestination*                       PreviousDestination;                           // 0x0248 (0x0004) [0x0000000000000000]               
	struct FVector                                     ExternalForce;                                 // 0x024C (0x000C) [0x0000000000000000]               
	float                                              InterpZTranslation;                            // 0x0258 (0x0004) [0x0000000000000000]               
	int32_t                                            Health;                                        // 0x025C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DeadBodyDuration;                              // 0x0260 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                              // 0x0264 (0x0004) [0x00000000040A000A] (CPF_Const | CPF_ExportObject | CPF_EditConst | CPF_Component | CPF_EditInline)
	int32_t                                            ConformTraceFrameCount;                        // 0x0268 (0x0004) [0x0000000000002000] (CPF_Transient)
	int32_t                                            AwareUpdateFrameCount;                         // 0x026C (0x0004) [0x0000000000002000] (CPF_Transient)
	class TArray<class AActor*>                        NearbyDynamics;                                // 0x0270 (0x000C) [0x0000000000402000] (CPF_Transient | CPF_NeedCtorLink)
	class TArray<class AGameCrowdForcePoint*>          RelevantAttractors;                            // 0x027C (0x000C) [0x0000000000402000] (CPF_Transient | CPF_NeedCtorLink)
	uint32_t                                           bUniformScale : 1;                             // 0x0288 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bCheckForObstacles : 1;                        // 0x0288 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bUseNavMeshPathing : 1;                        // 0x0288 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bWantsSeePlayerNotification : 1;               // 0x0288 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bAllowPitching : 1;                            // 0x0288 (0x0004) [0x0000000000000001] [0x00000010] (CPF_Edit)
	uint32_t                                           bHitObstacle : 1;                              // 0x0288 (0x0004) [0x0000000000000000] [0x00000020] 
	uint32_t                                           bBadHitNormal : 1;                             // 0x0288 (0x0004) [0x0000000000000000] [0x00000040] 
	uint32_t                                           bSimulateThisTick : 1;                         // 0x0288 (0x0004) [0x0000000000000000] [0x00000080] 
	uint32_t                                           bClampMovementSpeed : 1;                       // 0x0288 (0x0004) [0x0000000000000001] [0x00000100] (CPF_Edit)
	uint32_t                                           bPotentialEncounter : 1;                       // 0x0288 (0x0004) [0x0000000000000000] [0x00000200] 
	uint32_t                                           bIsPanicked : 1;                               // 0x0288 (0x0004) [0x0000000000000000] [0x00000400] 
	uint32_t                                           bWantsGroupIdle : 1;                           // 0x0288 (0x0004) [0x0000000000000000] [0x00000800] 
	uint32_t                                           bPreferVisibleDestination : 1;                 // 0x0288 (0x0004) [0x0000000000000001] [0x00001000] (CPF_Edit)
	uint32_t                                           bPreferVisibleDestinationOnSpawn : 1;          // 0x0288 (0x0004) [0x0000000000000001] [0x00002000] (CPF_Edit)
	uint32_t                                           bHasNotifiedSpawner : 1;                       // 0x0288 (0x0004) [0x0000000000000000] [0x00004000] 
	uint32_t                                           bIsInSpawnPool : 1;                            // 0x0288 (0x0004) [0x0000000000000000] [0x00008000] 
	EConformType                                       ConformType;                                   // 0x028C (0x0001) [0x0000000000000001] (CPF_Edit)    
	float                                              ConformTraceDist;                              // 0x0290 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            ConformTraceInterval;                          // 0x0294 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            CurrentConformTraceInterval;                   // 0x0298 (0x0004) [0x0000000000000000]               
	float                                              LastGroundZ;                                   // 0x029C (0x0004) [0x0000000000000000]               
	float                                              AwareRadius;                                   // 0x02A0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            AwareUpdateInterval;                           // 0x02A4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AvoidOtherStrength;                            // 0x02A8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AvoidPlayerStrength;                           // 0x02AC (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AvoidOtherRadius;                              // 0x02B0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              GroupAttractionStrength;                       // 0x02B4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MatchVelStrength;                              // 0x02B8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FollowPathStrength;                            // 0x02BC (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              VelocityDamping;                               // 0x02C0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              RotateToTargetSpeed;                           // 0x02C4 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxYawRate;                                    // 0x02C8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     MeshMinScale3D;                                // 0x02CC (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     MeshMaxScale3D;                                // 0x02D8 (0x000C) [0x0000000000000001] (CPF_Edit)    
	float                                              EyeZOffset;                                    // 0x02E4 (0x0004) [0x0000000000000000]               
	float                                              ProximityLODDist;                              // 0x02E8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              VisibleProximityLODDist;                       // 0x02EC (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     LastKnownGoodPosition;                         // 0x02F0 (0x000C) [0x0000000000000000]               
	float                                              GroundOffset;                                  // 0x02FC (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     IntermediatePoint;                             // 0x0300 (0x000C) [0x0000000000000000]               
	struct FVector                                     SearchExtent;                                  // 0x030C (0x000C) [0x0000000000000000]               
	class UClass*                                      NavigationHandleClass;                         // 0x0318 (0x0004) [0x0000000000000000]               
	class UNavigationHandle*                           NavigationHandle;                              // 0x031C (0x0004) [0x0000000000000000]               
	int32_t                                            ObstacleCheckCount;                            // 0x0320 (0x0004) [0x0000000000000000]               
	float                                              WalkableFloorZ;                                // 0x0324 (0x0004) [0x0000000000000000]               
	float                                              LastPathingAttempt;                            // 0x0328 (0x0004) [0x0000000000000000]               
	float                                              LastUpdateTime;                                // 0x032C (0x0004) [0x0000000000000000]               
	float                                              NotVisibleLifeSpan;                            // 0x0330 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              NotVisibleTickScalingFactor;                   // 0x0334 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class AGameCrowdAgent*                             MyArchetype;                                   // 0x0338 (0x0004) [0x0000000000000000]               
	float                                              MaxWalkingSpeed;                               // 0x033C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxRunningSpeed;                               // 0x0340 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxSpeed;                                      // 0x0344 (0x0004) [0x0000000000000000]               
	class TArray<struct FRecentInteraction>            RecentInteractions;                            // 0x0348 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              BeaconMaxDist;                                 // 0x0354 (0x0004) [0x0000000000000000]               
	struct FVector                                     BeaconOffset;                                  // 0x0358 (0x000C) [0x0000000000000000]               
	class UTexture2D*                                  BeaconTexture;                                 // 0x0364 (0x0004) [0x0000000000000002] (CPF_Const)   
	struct FLinearColor                                BeaconColor;                                   // 0x0368 (0x0010) [0x0000000000000002] (CPF_Const)   
	class USoundCue*                                   AmbientSoundCue;                               // 0x0378 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UAudioComponent*                             AmbientSoundComponent;                         // 0x037C (0x0004) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	class UGameCrowdAgentBehavior*                     CurrentBehavior;                               // 0x0380 (0x0004) [0x0000000000000000]               
	class TArray<struct FBehaviorEntry>                EncounterAgentBehaviors;                       // 0x0384 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FBehaviorEntry>                SeePlayerBehaviors;                            // 0x0390 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              MaxSeePlayerDistSq;                            // 0x039C (0x0004) [0x0000000000000000]               
	float                                              SeePlayerInterval;                             // 0x03A0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class TArray<struct FBehaviorEntry>                SpawnBehaviors;                                // 0x03A4 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FBehaviorEntry>                PanicBehaviors;                                // 0x03B0 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FBehaviorEntry>                RandomBehaviors;                               // 0x03BC (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              RandomBehaviorInterval;                        // 0x03C8 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ForceUpdateTime;                               // 0x03CC (0x0004) [0x0000000000000000]               
	float                                              ReachThreshold;                                // 0x03D0 (0x0004) [0x0000000000000000]               
	class TArray<struct FBehaviorEntry>                GroupWaitingBehaviors;                         // 0x03D4 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              DesiredGroupRadius;                            // 0x03E0 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              DesiredGroupRadiusSq;                          // 0x03E4 (0x0004) [0x0000000000000000]               
	float                                              MaxLOSLifeDistanceSq;                          // 0x03E8 (0x0004) [0x0000000000000000]               
	class UGameCrowdSpawnerInterface*                  MySpawner_Object;                              // 0x03EC (0x0004) [0x0000000000000000] 
	class UGameCrowdSpawnerInterface*                  MySpawner_Interface;                           // 0x03F0 (0x0004) [0x0000000000000000]               
	struct FVector                                     SpawnOffset;                                   // 0x03F4 (0x000C) [0x0000000000000000]               
	float                                              InitialLastRenderTime;                         // 0x0400 (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdAgent");
		}

		return uClassPointer;
	};

	class FString GetBehaviorString();
	class FString GetDestString();
	void eventPostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	void NativePostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	struct FVector eventGeneratePathToActor(class AActor* Goal, float optionalWithinDistance, bool optionalBAllowPartialPath);
	void eventInitNavigationHandle();
	void eventOverlappedActorEvent(class AActor* A);
	void TakeDamage(int32_t DamageAmount, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& optionalHitInfo, class AActor* optionalDamageCauser);
	void eventFireDeathEvent();
	void PlayDeath(const struct FVector& KillMomentum);
	void eventUpdateIntermediatePoint(class AActor* optionalDestinationActor);
	bool CalcCamera(float fDeltaTime, struct FVector& outOut_CamLoc, struct FRotator& outOut_CamRot, float& outOut_FOV);
	bool IsIdle();
	void SetCurrentBehavior(class UGameCrowdAgentBehavior* BehaviorArchetype);
	void eventStopBehavior();
	void ActivateInstancedBehavior(class UGameCrowdAgentBehavior* NewBehaviorObject);
	void eventActivateBehavior(class UGameCrowdAgentBehavior* NewBehaviorArchetype);
	void ResetSeePlayer();
	void TryRandomBehavior();
	void eventNotifySeePlayer(class APlayerController* PC);
	void PlaySpawnBehavior();
	void eventHandlePotentialAgentEncounter();
	void eventStopIdleAnimation();
	void eventPlayIdleAnimation();
	void OnPlayAgentAnimation(class USeqAct_PlayAgentAnimation* Action);
	void InitializeAgent(class AActor* SpawnLoc, class AGameCrowdAgent* AgentTemplate, class UGameCrowdGroup* NewGroup, float AgentWarmupTime, bool bWarmupPosition, bool bCheckWarmupVisibility);
	void SetLighting(bool bEnableLightEnvironment, const struct FLightingChannelContainer& AgentLightingChannel, bool bCastShadows);
	void DisplayDebug(class AHUD* HUD, float& outOut_YL, float& outOut_YPos);
	void Destroyed();
	void ResetPooledAgent();
	void eventKillAgent();
	void PostBeginPlay();
	void SetMaxSpeed();
	void eventSetCurrentDestination(class AGameCrowdDestination* NewDest);
	void eventWaitForGroupMembers();
	bool PickBehaviorFrom(const class TArray<struct FBehaviorEntry>& BehaviorList, const struct FVector& optionalBestCameraLoc);
	void SetPanic(class AActor* PanicActor, bool bNewPanic);
	bool IsPanicked();
	void eventFellOutOfWorld(class UClass* dmgType);
};

// Class GameFramework.GameCrowdAgentSkeletal
// 0x0080 (0x0404 - 0x0484)
class AGameCrowdAgentSkeletal : public AGameCrowdAgent
{
public:
	class USkeletalMeshComponent*                      SkeletalMeshComponent;                         // 0x0404 (0x0004) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	class UAnimNodeBlend*                              SpeedBlendNode;                                // 0x0408 (0x0004) [0x0000000000000000]               
	class UAnimNodeSlot*                               FullBodySlot;                                  // 0x040C (0x0004) [0x0000000000000000]               
	class UAnimNodeSequence*                           ActionSeqNode;                                 // 0x0410 (0x0004) [0x0000000000000000]               
	class UAnimNodeSequence*                           WalkSeqNode;                                   // 0x0414 (0x0004) [0x0000000000000000]               
	class UAnimNodeSequence*                           RunSeqNode;                                    // 0x0418 (0x0004) [0x0000000000000000]               
	class UAnimTree*                                   AgentTree;                                     // 0x041C (0x0004) [0x0000000000000000]               
	class TArray<class FName>                          WalkAnimNames;                                 // 0x0420 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<class FName>                          RunAnimNames;                                  // 0x042C (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<class FName>                          IdleAnimNames;                                 // 0x0438 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<class FName>                          DeathAnimNames;                                // 0x0444 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              SpeedBlendStart;                               // 0x0450 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              SpeedBlendEnd;                                 // 0x0454 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AnimVelRate;                                   // 0x0458 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxSpeedBlendChangeSpeed;                      // 0x045C (0x0004) [0x0000000000000001] (CPF_Edit)    
	class FName                                        MoveSyncGroupName;                             // 0x0460 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class TArray<struct FGameCrowdAttachmentList>      Attachments;                                   // 0x0468 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              MaxTargetAcquireTime;                          // 0x0474 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bUseRootMotionVelocity : 1;                    // 0x0478 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bIsPlayingIdleAnimation : 1;                   // 0x0478 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bIsPlayingDeathAnimation : 1;                  // 0x0478 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bAnimateThisTick : 1;                          // 0x0478 (0x0004) [0x0000000000000000] [0x00000008] 
	float                                              MaxAnimationDistance;                          // 0x047C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxAnimationDistanceSq;                        // 0x0480 (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdAgentSkeletal");
		}

		return uClassPointer;
	};

	void CreateAttachments();
	void eventOnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void eventStopIdleAnimation();
	void eventPlayIdleAnimation();
	void eventClearLatentAnimation();
	void OnPlayAgentAnimation(class USeqAct_PlayAgentAnimation* Action);
	void SetRootMotion(bool bRootMotionEnabled);
	void PlayDeath(const struct FVector& KillMomentum);
	void SetLighting(bool bEnableLightEnvironment, const struct FLightingChannelContainer& AgentLightingChannel, bool bCastShadows);
	void PostBeginPlay();
};

// Class GameFramework.GameCrowdAgentBehavior
// 0x0010 (0x003C - 0x004C)
class UGameCrowdAgentBehavior : public UObject
{
public:
	uint32_t                                           bIdleBehavior : 1;                             // 0x003C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bFaceActionTargetFirst : 1;                    // 0x003C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bIsViralBehavior : 1;                          // 0x003C (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bIsPanicked : 1;                               // 0x003C (0x0004) [0x0000000000000000] [0x00000008] 
	class AActor*                                      ActionTarget;                                  // 0x0040 (0x0004) [0x0000000000000000]               
	float                                              MaxPlayerDistance;                             // 0x0044 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class AGameCrowdAgent*                             MyAgent;                                       // 0x0048 (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdAgentBehavior");
		}

		return uClassPointer;
	};

	bool AllowBehaviorAt(class AGameCrowdDestination* Destination);
	bool AllowThisDestination(class AGameCrowdDestination* Destination);
	void eventPropagateViralBehaviorTo(class AGameCrowdAgent* OtherAgent);
	void ActivatedBy(class AActor* NewActionTarget);
	class AActor* GetDestinationActor();
	void ChangingDestination(class AGameCrowdDestination* NewDest);
	class FString GetBehaviorString();
	void eventOnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void StopBehavior();
	void InitBehavior(class AGameCrowdAgent* Agent);
	bool HandleMovement();
	void eventFinishedTargetRotation();
	bool CanBeUsedBy(class AGameCrowdAgent* Agent, const struct FVector& cameraLoc);
	void Tick(float DeltaTime);
	bool ShouldEndIdle();
};

// Class GameFramework.GameCrowdBehavior_PlayAnimation
// 0x002C (0x004C - 0x0078)
class UGameCrowdBehavior_PlayAnimation : public UGameCrowdAgentBehavior
{
public:
	class TArray<class FName>                          AnimationList;                                 // 0x004C (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              BlendInTime;                                   // 0x0058 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BlendOutTime;                                  // 0x005C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bUseRootMotion : 1;                            // 0x0060 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bLookAtPlayer : 1;                             // 0x0060 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bLooping : 1;                                  // 0x0060 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bBlendBetweenAnims : 1;                        // 0x0060 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	class AActor*                                      CustomActionTarget;                            // 0x0064 (0x0004) [0x0000000000000000]               
	int32_t                                            LoopIndex;                                     // 0x0068 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              LoopTime;                                      // 0x006C (0x0004) [0x0000000000000001] (CPF_Edit)    
	class USeqAct_PlayAgentAnimation*                  AnimSequence;                                  // 0x0070 (0x0004) [0x0000000000000000]               
	int32_t                                            AnimationIndex;                                // 0x0074 (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdBehavior_PlayAnimation");
		}

		return uClassPointer;
	};

	class FString GetBehaviorString();
	void StopBehavior();
	void PlayAgentAnimationNow();
	void eventOnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void SetSequenceOutput();
	void eventFinishedTargetRotation();
	void InitBehavior(class AGameCrowdAgent* Agent);
};

// Class GameFramework.GameCrowdBehavior_RunFromPanic
// 0x0004 (0x004C - 0x0050)
class UGameCrowdBehavior_RunFromPanic : public UGameCrowdAgentBehavior
{
public:
	class AActor*                                      PanicFocus;                                    // 0x004C (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdBehavior_RunFromPanic");
		}

		return uClassPointer;
	};

	class FString GetBehaviorString();
	bool AllowBehaviorAt(class AGameCrowdDestination* Destination);
	bool AllowThisDestination(class AGameCrowdDestination* Destination);
	void eventPropagateViralBehaviorTo(class AGameCrowdAgent* OtherAgent);
	void StopBehavior();
	void InitBehavior(class AGameCrowdAgent* Agent);
	void ActivatedBy(class AActor* NewActionTarget);
};

// Class GameFramework.GameCrowdBehavior_WaitForGroup
// 0x0000 (0x004C - 0x004C)
class UGameCrowdBehavior_WaitForGroup : public UGameCrowdAgentBehavior
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitForGroup");
		}

		return uClassPointer;
	};

	void StopBehavior();
	bool ShouldEndIdle();
	class FString GetBehaviorString();
	void InitBehavior(class AGameCrowdAgent* Agent);
};

// Class GameFramework.GameCrowdBehavior_WaitInQueue
// 0x0008 (0x004C - 0x0054)
class UGameCrowdBehavior_WaitInQueue : public UGameCrowdAgentBehavior
{
public:
	uint32_t                                           bStoppingBehavior : 1;                         // 0x004C (0x0004) [0x0000000000000000] [0x00000001] 
	class AGameCrowdDestinationQueuePoint*             QueuePosition;                                 // 0x0050 (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitInQueue");
		}

		return uClassPointer;
	};

	void StopBehavior();
	bool ShouldEndIdle();
	class FString GetBehaviorString();
	class AActor* GetDestinationActor();
	void ChangingDestination(class AGameCrowdDestination* NewDest);
	bool HandleMovement();
};

// Class GameFramework.GameCrowdGroup
// 0x000C (0x003C - 0x0048)
class UGameCrowdGroup : public UObject
{
public:
	class TArray<class AGameCrowdAgent*>               Members;                                       // 0x003C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdGroup");
		}

		return uClassPointer;
	};

	void UpdateDestinations(class AGameCrowdDestination* NewDestination);
	void RemoveMember(class AGameCrowdAgent* Agent);
	void AddMember(class AGameCrowdAgent* Agent);
};

// Class GameFramework.GameCrowdInteractionPoint
// 0x0008 (0x0228 - 0x0230)
class AGameCrowdInteractionPoint : public AActor
{
public:
	uint32_t                                           bIsEnabled : 1;                                // 0x0228 (0x0004) [0x0000000000000021] [0x00000001] (CPF_Edit | CPF_Net)
	class UCylinderComponent*                          CylinderComponent;                             // 0x022C (0x0004) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdInteractionPoint");
		}

		return uClassPointer;
	};

	void OnToggle(class USeqAct_Toggle* Action);
};

// Class GameFramework.GameCrowdDestination
// 0x0084 (0x0230 - 0x02B4)
class AGameCrowdDestination : public AGameCrowdInteractionPoint
{
public:
	struct FPointer                                    VfTable_IEditorLinkSelectionInterface;         // 0x0230 (0x0004) [0x0000000000801002] (CPF_Const | CPF_Native | CPF_NoExport)
	uint32_t                                           bKillWhenReached : 1;                          // 0x0234 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bAllowAsPreviousDestination : 1;               // 0x0234 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bLastAllowableResult : 1;                      // 0x0234 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bAvoidWhenPanicked : 1;                        // 0x0234 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bSkipBehaviorIfPanicked : 1;                   // 0x0234 (0x0004) [0x0000000000000001] [0x00000010] (CPF_Edit)
	uint32_t                                           bFleeDestination : 1;                          // 0x0234 (0x0004) [0x0000000000000001] [0x00000020] (CPF_Edit)
	uint32_t                                           bMustReachExactly : 1;                         // 0x0234 (0x0004) [0x0000000000000001] [0x00000040] (CPF_Edit)
	uint32_t                                           bHasRestrictions : 1;                          // 0x0234 (0x0004) [0x0000000000000000] [0x00000080] 
	uint32_t                                           bAllowsSpawning : 1;                           // 0x0234 (0x0004) [0x0000000000000001] [0x00000100] (CPF_Edit)
	uint32_t                                           bLineSpawner : 1;                              // 0x0234 (0x0004) [0x0000000000000001] [0x00000200] (CPF_Edit)
	uint32_t                                           bSpawnAtEdge : 1;                              // 0x0234 (0x0004) [0x0000000000000001] [0x00000400] (CPF_Edit)
	uint32_t                                           bSoftPerimeter : 1;                            // 0x0234 (0x0004) [0x0000000000000001] [0x00000800] (CPF_Edit)
	uint32_t                                           bIsVisible : 1;                                // 0x0234 (0x0004) [0x0000000000000000] [0x00001000] 
	uint32_t                                           bWillBeVisible : 1;                            // 0x0234 (0x0004) [0x0000000000000000] [0x00002000] 
	uint32_t                                           bCanSpawnHereNow : 1;                          // 0x0234 (0x0004) [0x0000000000000000] [0x00004000] 
	uint32_t                                           bIsBeyondSpawnDistance : 1;                    // 0x0234 (0x0004) [0x0000000000000000] [0x00008000] 
	uint32_t                                           bAdjacentToVisibleNode : 1;                    // 0x0234 (0x0004) [0x0000000000000000] [0x00010000] 
	uint32_t                                           bHasNavigationMesh : 1;                        // 0x0234 (0x0004) [0x0000000000000000] [0x00020000] 
	class TArray<class AGameCrowdDestination*>         NextDestinations;                              // 0x0238 (0x000C) [0x0000000000600001] (CPF_Edit | CPF_NeedCtorLink)
	class AGameCrowdDestinationQueuePoint*             QueueHead;                                     // 0x0244 (0x0004) [0x0000000000200001] (CPF_Edit)    
	int32_t                                            Capacity;                                      // 0x0248 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Frequency;                                     // 0x024C (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            CustomerCount;                                 // 0x0250 (0x0004) [0x0000000000000000]               
	class TArray<class UClass*>                        SupportedAgentClasses;                         // 0x0254 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<class UObject*>                       SupportedArchetypes;                           // 0x0260 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<class UClass*>                        RestrictedAgentClasses;                        // 0x026C (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<class UObject*>                       RestrictedArchetypes;                          // 0x0278 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              ExactReachTolerance;                           // 0x0284 (0x0004) [0x0000000000000000]               
	class FName                                        InteractionTag;                                // 0x0288 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              InteractionDelay;                              // 0x0290 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              SpawnRadius;                                   // 0x0294 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class TArray<struct FBehaviorEntry>                ReachedBehaviors;                              // 0x0298 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class AGameCrowdAgent*                             AgentEnRoute;                                  // 0x02A4 (0x0004) [0x0000000000000000]               
	float                                              Priority;                                      // 0x02A8 (0x0004) [0x0000000000000000]               
	float                                              LastSpawnTime;                                 // 0x02AC (0x0004) [0x0000000000000000]               
	class AGameCrowdPopulationManager*                 MyPopMgr;                                      // 0x02B0 (0x0004) [0x0000000000002000] (CPF_Transient)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdDestination");
		}

		return uClassPointer;
	};

	void GetSpawnPosition(class USeqAct_GameCrowdSpawner* Spawner, struct FVector& outSpawnPos, struct FRotator& outSpawnRot);
	bool eventAllowableDestinationFor(class AGameCrowdAgent* Agent);
	bool AtCapacity();
	void eventIncrementCustomerCount(class AGameCrowdAgent* ArrivingAgent);
	void eventDecrementCustomerCount(class AGameCrowdAgent* DepartingAgent);
	void PickNewDestinationFor(class AGameCrowdAgent* Agent, bool bIgnoreRestrictions);
	void eventReachedDestination(class AGameCrowdAgent* Agent);
	void Destroyed();
	void PostBeginPlay();
	bool ReachedByAgent(class AGameCrowdAgent* Agent, const struct FVector& TestPosition, bool bTestExactly);
};

// Class GameFramework.GameCrowdDestinationQueuePoint
// 0x001C (0x0230 - 0x024C)
class AGameCrowdDestinationQueuePoint : public AGameCrowdInteractionPoint
{
public:
	class AGameCrowdDestinationQueuePoint*             NextQueuePosition;                             // 0x0230 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class AGameCrowdInteractionPoint*                  PreviousQueuePosition;                         // 0x0234 (0x0004) [0x0000000000000000]               
	class AGameCrowdAgent*                             QueuedAgent;                                   // 0x0238 (0x0004) [0x0000000000000000]               
	class AGameCrowdDestination*                       QueueDestination;                              // 0x023C (0x0004) [0x0000000000002000] (CPF_Transient)
	uint32_t                                           bClearingQueue : 1;                            // 0x0240 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bPendingAdvance : 1;                           // 0x0240 (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              AverageReactionTime;                           // 0x0244 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UClass*                                      QueueBehaviorClass;                            // 0x0248 (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdDestinationQueuePoint");
		}

		return uClassPointer;
	};

	bool HasCustomer();
	void ClearQueue(class AGameCrowdAgent* OldCustomer);
	void AddCustomer(class AGameCrowdAgent* NewCustomer, class AGameCrowdInteractionPoint* PreviousPosition);
	void ActuallyAdvance();
	void AdvanceCustomerTo(class AGameCrowdInteractionPoint* FrontPosition);
	void eventReachedDestination(class AGameCrowdAgent* Agent);
	bool HasSpace();
	bool QueueReachedBy(class AGameCrowdAgent* Agent, const struct FVector& TestPosition);
};

// Class GameFramework.GameCrowdForcePoint
// 0x0000 (0x0230 - 0x0230)
class AGameCrowdForcePoint : public AGameCrowdInteractionPoint
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdForcePoint");
		}

		return uClassPointer;
	};

	struct FVector eventAppliedForce(class AGameCrowdAgent* Agent);
	void eventUnTouch(class AActor* Other);
	void eventTouch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
};

// Class GameFramework.GameCrowdAttractor
// 0x0008 (0x0230 - 0x0238)
class AGameCrowdAttractor : public AGameCrowdForcePoint
{
public:
	float                                              Attraction;                                    // 0x0230 (0x0004) [0x0000000000000001] (CPF_Edit | CPF_Interp)
	uint32_t                                           bAttractionFalloff : 1;                        // 0x0234 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdAttractor");
		}

		return uClassPointer;
	};

	struct FVector eventAppliedForce(class AGameCrowdAgent* Agent);
};

// Class GameFramework.GameCrowdRepulsor
// 0x0008 (0x0230 - 0x0238)
class AGameCrowdRepulsor : public AGameCrowdForcePoint
{
public:
	float                                              Repulsion;                                     // 0x0230 (0x0004) [0x0000000000000001] (CPF_Edit | CPF_Interp)
	uint32_t                                           bAttractionFalloff : 1;                        // 0x0234 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdRepulsor");
		}

		return uClassPointer;
	};

	struct FVector eventAppliedForce(class AGameCrowdAgent* Agent);
};

// Class GameFramework.GameCrowdPopulationManager
// 0x0098 (0x0228 - 0x02C0)
class AGameCrowdPopulationManager : public ACrowdPopulationManagerBase
{
public:
	struct FPointer                                    VfTable_IInterface_NavigationHandle;           // 0x0228 (0x0004) [0x0000000000801002] (CPF_Const | CPF_Native | CPF_NoExport)
	uint32_t                                           bSpawningActive : 1;                           // 0x022C (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bEnableCrowdLightEnvironment : 1;              // 0x022C (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bCastShadows : 1;                              // 0x022C (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bForceObstacleChecking : 1;                    // 0x022C (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bForceNavMeshPathing : 1;                      // 0x022C (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bHaveInitialPopulation : 1;                    // 0x022C (0x0004) [0x0000000000000000] [0x00000020] 
	uint32_t                                           bWarmupPosition : 1;                           // 0x022C (0x0004) [0x0000000000000001] [0x00000040] (CPF_Edit)
	float                                              SpawnRate;                                     // 0x0230 (0x0004) [0x0000000000000000]               
	int32_t                                            SpawnNum;                                      // 0x0234 (0x0004) [0x0000000000000000]               
	float                                              SplitScreenNumReduction;                       // 0x0238 (0x0004) [0x0000000000000000]               
	float                                              Remainder;                                     // 0x023C (0x0004) [0x0000000000000000]               
	float                                              AgentFrequencySum;                             // 0x0240 (0x0004) [0x0000000000000000]               
	class TArray<struct FAgentArchetypeInfo>           AgentArchetypes;                               // 0x0244 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<class AGameCrowdAgent*>               AgentPool;                                     // 0x0250 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            MaxAgentPoolSize;                              // 0x025C (0x0004) [0x0000000000000000]               
	int32_t                                            AgentCount;                                    // 0x0260 (0x0004) [0x0000000000000000]               
	struct FLightingChannelContainer                   AgentLightingChannel;                          // 0x0264 (0x0004) [0x0000000000000000]               
	float                                              AgentWarmupTime;                               // 0x0268 (0x0004) [0x0000000000000000]               
	float                                              SpawnPrioritizationInterval;                   // 0x026C (0x0004) [0x0000000000000000]               
	int32_t                                            PrioritizationIndex;                           // 0x0270 (0x0004) [0x0000000000000000]               
	int32_t                                            PrioritizationUpdateIndex;                     // 0x0274 (0x0004) [0x0000000000000000]               
	class TArray<class AGameCrowdDestination*>         PrioritizedSpawnPoints;                        // 0x0278 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              PlayerPositionPredictionTime;                  // 0x0284 (0x0004) [0x0000000000000000]               
	class TArray<class AGameCrowdDestination*>         PotentialSpawnPoints;                          // 0x0288 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              MaxSpawnDist;                                  // 0x0294 (0x0004) [0x0000000000000000]               
	float                                              MaxSpawnDistSq;                                // 0x0298 (0x0004) [0x0000000000000000]               
	float                                              MinBehindSpawnDistSq;                          // 0x029C (0x0004) [0x0000000000000000]               
	int32_t                                            SpawnedCount;                                  // 0x02A0 (0x0004) [0x0000000000000000]               
	int32_t                                            PoolCount;                                     // 0x02A4 (0x0004) [0x0000000000000000]               
	int32_t                                            KilledCount;                                   // 0x02A8 (0x0004) [0x0000000000000000]               
	float                                              HeadVisibilityOffset;                          // 0x02AC (0x0004) [0x0000000000000000]               
	float                                              InitialPopulationPct;                          // 0x02B0 (0x0004) [0x0000000000000000]               
	class UClass*                                      NavigationHandleClass;                         // 0x02B4 (0x0004) [0x0000000000000000]               
	class UNavigationHandle*                           NavigationHandle;                              // 0x02B8 (0x0004) [0x0000000000000000]               
	class AGameCrowdAgent*                             QueryingAgent;                                 // 0x02BC (0x0004) [0x0000000000000000]               

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class GameFramework.GameCrowdPopulationManager");
		}

		return uClassPointer;
	};

	class AGameCrowdAgent* CreateNewAgent(class AGameCrowdDestination* SpawnLoc, class AGameCrowdAgent* AgentTemplate, class UGameCrowdGroup* NewGroup);
	class AGameCrowdAgent* eventSpawnAgent(class AGameCrowdDestination* SpawnLoc);
	bool ValidateSpawnAt(class AGameCrowdDestination* Candidate);
	void AddPrioritizedSpawnPoint(class AGameCrowdDestination* GCD, const struct FVector& ViewLocation);
	void AnalyzeSpawnPoints(int32_t StartIndex, int32_t StopIndex, const struct FVector& ViewLocation, const struct FVector& PredictionLocation);
	void PrioritizeSpawnPoints(float DeltaSeconds);
	class AGameCrowdDestination* PickSpawnPoint();
	void Tick(float DeltaSeconds);
	void DisplayDebug(class AHUD* HUD, float& outOut_YL, float& outOut_YPos);
	bool AddToAgentPool(class AGameCrowdAgent* Agent);
	void AgentDestroyed(class AGameCrowdAgent* Agent);
	void OnGameCrowdPopulationManagerToggle(class USeqAct_GameCrowdPopulationManagerToggle* inAction);
	void RemoveSpawnPoint(class AGameCrowdDestination* GCD);
	void AddSpawnPoint(class AGameCrowdDestination* GCD);
	float GetMaxSpawnDist();
	void eventNotifyPathChanged();
	void PostBeginPlay();
};

// Class GameFramework.GameCrowdReplicationActor
// 0x000C (0x0228 - 0x0234)
class AGameCrowdReplicationActor : public AActor
{
public:
	class USeqAct_GameCrowdSpawner*                    Spawner;                                       // 0x0228 (0x0004) [0x0000000000000020] (CPF_Net | CPF_RepNotify)
	uint32_t                                           bSpawningActive : 1;                           // 0x022C (0x0004) [0x0000000000000020] [0x00000001] (CPF_Net | CPF_RepNotify)
