/*
#############################################################################################
# Alice2 (ASDK) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.6
# ========================================================================================= #
# File: Kynapse_classes.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

// Forward Declarations
class UClass;
class UFunction;
class UProperty;
class UStructProperty;
class UStruct;


/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_nbMaxAdditionalData                                   4
#define CONST_nbBrainServices                                       5
#define CONST_nbAgents                                              15
#define CONST_smallestMove                                          10.0
#define CONST_smallestSize                                          30.0
#define CONST_fastestSpeed                                          200.0
#define CONST_nbAdditionalData                                      5
#define CONST_nbWorldServices                                       10
#define CONST_nbTeams                                               10
#define CONST_nbTaskSetPriorities                                   8

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum Kynapse.FpdBuilder.E_FB_ProjectType
enum class E_FB_ProjectType : uint8_t
{
	E_FB_Dynamic                                       = 0,
	E_FB_Direct                                        = 1,
	E_FB_Default                                       = 2,
	E_FB_END                                           = 3
};

// Enum Kynapse.FpdBuilder.EDisplayInEditorType
enum class EDisplayInEditorType : uint8_t
{
	DisplayEditor_None                                 = 0,
	DisplayEditor_All_Always                           = 1,
	DisplayEditor_Links_Always                         = 2,
	DisplayEditor_All_Selected                         = 3,
	DisplayEditor_Links_Selected                       = 4,
	DisplayEditor_PO_Only                              = 5,
	DisplayEditor_END                                  = 6
};

// Enum Kynapse.FpdBuilder.EPrelinkCanGoCbk
enum class EPrelinkCanGoCbk : uint8_t
{
	CanGo_AiMesh                                       = 0,
	CanGo_Capsule                                      = 1,
	CanGo_END                                          = 2
};

// Enum Kynapse.SphinxTeamContainer.ESphinxTeamContainerType
enum class ESphinxTeamContainerType : uint8_t
{
	ESTCT_NormalFightTeam                              = 0,
	ESTCT_SwarmFightTeam                               = 1,
	ESTCT_END                                          = 2
};

// Enum Kynapse.KynapseWorldServiceLpfManager.ELpf3dMode
enum class ELpf3dMode : uint8_t
{
	LPF2D                                              = 0,
	LPF3D                                              = 1,
	ELpf3dMode_END                                     = 2
};

// Enum Kynapse.KynapseWorldServiceMapBuilder.ECollisionModel
enum class ECollisionModel : uint8_t
{
	A_Sphere                                           = 0,
	B_SweptSphere                                      = 1,
	ECollisionModel_END                                = 2
};

// Enum Kynapse.KynapseWorldServiceMapBuilder.EProcessStep
enum class EProcessStep : uint8_t
{
	A_Exploration                                      = 0,
	B_Analysis                                         = 1,
	C_GraphCreation                                    = 2,
	D_GraphOptimization                                = 3,
	EProcessStep_END                                   = 4
};

// Enum Kynapse.SphinxAgentFight.EAliceWeaponType_REF
enum class EAliceWeaponType_REF : uint8_t
{
	EAWTR_None                                         = 0,
	EAWTR_VorpalBlade                                  = 1,
	EAWTR_HobbyHorse                                   = 2,
	EAWTR_EyeStaff                                     = 3,
	EAWTR_TeapotCannon                                 = 4,
	EAWTR_NpcProject                                   = 5,
	EAWTR_All                                          = 6,
	EAWTR_END                                          = 7
};

// Enum Kynapse.SphinxAgentFight.SphinxMiscActionConditionType
enum class ESphinxMiscActionConditionType : uint8_t
{
	e_SMACT_IsLockedOn                                 = 0,
	e_SMACT_NPCNumReduceChange                         = 1,
	e_SMACT_NameTrigger                                = 2,
	e_SMACT_DetectLightRange                           = 3,
	e_SMACT_DetectHeavyRange                           = 4,
	e_SMACT_DetectLightMelee                           = 5,
	e_SMACT_DetectHeavyMelee                           = 6,
	e_SMACT_DetectDamage                               = 7,
	e_SMACT_DetectCollisionWithPlayer                  = 8,
	e_SMACT_DetectDistSmallThanHappen                  = 9,
	e_SMACT_DetectDistBigThanHappen                    = 10,
	e_SMACT_DetectAllNPCAttachedActorDead              = 11,
	e_SMACT_DetectNPCAttachedActorDead                 = 12,
	e_SMACT_DetectNPCAttachedActorDamage               = 13,
	e_SMACT_DetectNPCLandedFromFalling                 = 14,
	e_SMACT_DetectAliceEscapeGrab                      = 15,
	e_SMACT_DetectPawnOccupyCurrentGotoIndex           = 16,
	e_SMACT_DetectAliceDamage                          = 17,
	e_SMACT_DetectNPCAttachedActorDamagePercent        = 18,
	e_SMACT_Detect_Absoult_Height_Different_SmallThan_Happen = 19,
	e_SMACT_Detect_Absoult_Height_Different_BigThan_Happen = 20,
	e_SMACT_NoCondition                                = 21,
	e_SMACT_END                                        = 22
};

// Enum Kynapse.SphinxInterstingPoint.ESphinxIP
enum class ESphinxIP : uint8_t
{
	InteractIP                                         = 0,
	LookAtIP                                           = 1,
	ESphinxIP_END                                      = 2
};

// Enum Kynapse.SphinxSequenceEventBase.SphinxSequenceEventType
enum class ESphinxSequenceEventType : uint8_t
{
	e_SphinxSequenceET_PlayAnim                        = 0,
	e_SphinxSequenceET_PlaySound                       = 1,
	e_SphinxSequenceET_WaitTime                        = 2,
	e_SphinxSequenceET_PlayParticle                    = 3,
	e_SphinxSequenceET_PreAttackDist                   = 4,
	e_SphinxSequenceET_EventRagdoll                    = 5,
	e_SphinxSequenceET_DestroyComponent                = 6,
	e_SphinxSequenceET_ChangeMaterial                  = 7,
	e_SphinxSequenceET_FadeComponent                   = 8,
	e_SphinxSequenceET_SpawnPickup                     = 9,
	e_SphinxSequenceET_LockTargets                     = 10,
	e_SphinxSequenceET_UnattachComponent               = 11,
	e_SphinxSequenceET_ActiveShield                    = 12,
	e_SphinxSequenceET_ChangeAnimTreeBlendingBranch    = 13,
	e_SphinxSequenceAC_ConditionJump                   = 14,
	e_SphinxSequenceET_ChangeConditionIndex            = 15,
	e_SphinxSequenceET_RemoteEvent                     = 16,
	e_SphinxSequenceAC_Exit                            = 17,
	e_SphinxSequenceET_ModifyPawnHealth                = 18,
	e_SphinxSequenceET_SetNoDamageEffect               = 19,
	e_SphinxSequenceET_SetKnockBackPara                = 20,
	e_SphinxSequenceET_SetPhysic                       = 21,
	e_SphinxSequenceET_PlayMorphTarget                 = 22,
	e_SphinxSequenceET_RandomJump                      = 23,
	e_SphinxSequenceET_ChangeCollisionPhAT             = 24,
	e_SphinxSequenceET_AttchAlice                      = 25,
	e_SphinxSequenceET_RunAnotherPackage               = 26,
	e_SphinxSequenceET_ModifyRotateAndSpeed            = 27,
	e_SphinxSequenceET_ToggleSkeletalControl           = 28,
	e_SphinxSequenceET_AnnounceInFightProcess          = 29,
	e_SphinxSequenceET_ToggleCriticalUI                = 30,
	e_SphinxSequenceET_ChangeDamageAnim                = 31,
	e_SphinxSequenceET_ChangeAttachedActorDamageAnim   = 32,
	e_SphinxSequenceET_ChangeCollisionType             = 33,
	e_SphinxSequenceET_SetHideComponent                = 34,
	e_SphinxSequenceET_SetSonarActive                  = 35,
	e_SphinxSequenceET_SetSonarInfo                    = 36,
	e_SphinxSequenceET_SetNPCScale                     = 37,
	e_SphinxSequenceET_KillAttachedActor               = 38,
	e_SphinxSequenceET_ToggleAttachedActor             = 39,
	e_SphinxSequenceET_ToggleAttachedActorHidden       = 40,
	e_SphinxSequenceET_PlayAnimOnAttachedActor         = 41,
	e_SphinxSequenceET_SetHideSelf                     = 42,
	e_SphinxSequenceET_ToggleSubConditionActive        = 43,
	e_SphinxSequenceET_ToggleLoopSound                 = 44,
	e_SphinxSequenceET_ToggleLoopParticle              = 45,
	e_SphinxSequenceET_ToggleBlockingCheckWithDesiredBlockingVolumn = 46,
	e_SphinxSequenceET_ToggleBlockingCheckWithAlice    = 47,
	e_SphinxSequenceET_SetNPCDeath                     = 48,
	e_SphinxSequenceET_SetNPCFightAgentParam           = 49,
	e_SphinxSequenceET_ToggleNPCGodMode                = 50,
	e_SphinxSequenceET_ChangeMovingPhAT                = 51,
	e_SphinxSequenceET_SwitchCollisionBetweenPhATAndCylider = 52,
	e_SphinxSequenceET_Teleport                        = 53,
	e_SphinxSequenceET_SetGDGlobeValue                 = 54,
	e_SphinxSequenceET_SetGotoLocation                 = 55,
	e_SphinxSequenceET_MoveToGotoLocation              = 56,
	e_SphinxSequenceET_BlendToLocation                 = 57,
	e_SphinxSequenceET_SetAccelerate                   = 58,
	e_SphinxSequenceET_ActiveUIPrompt                  = 59,
	e_SphinxSequenceET_ToggleMessageEvent              = 60,
	e_SphinxSequenceET_ModifyPawnMaxHealth             = 61,
	e_SphinxSequenceET_MoveToOriginalSpawnLocation     = 62,
	e_END                                              = 63
};

// Enum Kynapse.SphinxSequenceActionConditionJump.SphinxSequenceConditionCheckType
enum class ESphinxSequenceConditionCheckType : uint8_t
{
	e_SSCCT_LastSequenceHitPlayer                      = 0,
	e_SSCCT_NoBlockToPlayer                            = 1,
	e_SSCCT_DistPlayer                                 = 2,
	e_SSCCT_DistPlayer2D                               = 3,
	e_SSCCT_AnglePlayer                                = 4,
	e_SSCCT_SelfHpPercent                              = 5,
	e_SSCCT_SelfHpAbsolute                             = 6,
	e_SSCCT_SelfInPlayerCamaraView                     = 7,
	e_SSCCT_PlayerHpPercent                            = 8,
	e_SSCCT_CheckComponentAttach                       = 9,
	e_SSCCT_CheckCurrentConditionIndex                 = 10,
	e_SSCCT_NumberOfTeammatesAttacking                 = 11,
	e_SSCCT_TriggerCountZero                           = 12,
	e_SSCCT_CheckPreviousConditionIndex                = 13,
	e_SSCCT_DistPlayer_X                               = 14,
	e_SSCCT_DistPlayer_Y                               = 15,
	e_SSCCT_DistPlayer_Z                               = 16,
	e_SSCCT_AliceDodgeing                              = 17,
	e_SSCCT_AliceDeflecting                            = 18,
	e_SSCCT_AliceJumping                               = 19,
	e_SSCCT_AliceShield                                = 20,
	e_SSCCT_NoWallInNPC_Direct                         = 21,
	e_SSCCT_NoWallInNPC_Left                           = 22,
	e_SSCCT_NoWallInNPC_Right                          = 23,
	e_SSCCT_CheckNPCAttachedActorAlive                 = 24,
	e_SSCCT_CheckNPCAttachedActorAwake                 = 25,
	e_SSCCT_CheckAliceAtNPCLeftOrRight                 = 26,
	e_SSCCT_CheckNPCAtAliceLeftOrRight                 = 27,
	e_SSCCT_CheckGD_GlobeValue                         = 28,
	e_SSCCT_CheckCurrentDifficult                      = 29,
	e_SSCCT_CheckSelfInSideCollision                   = 30,
	e_SSCCT_CheckAliceWeaponLevel                      = 31,
	e_SSCCT_CheckCountOfAttachedActorAlive             = 32,
	e_SSCCT_END                                        = 33
};

// Enum Kynapse.SphinxSequenceActionConditionJump.SphinxConditionExpressionType
enum class ESphinxConditionExpressionType : uint8_t
{
	e_SSET_Equal                                       = 0,
	e_SSET_GreaterThan                                 = 1,
	e_SSET_LessThan                                    = 2,
	e_SSET_END                                         = 3
};

// Enum Kynapse.SphinxSequenceEventChangeDamageAnim.EDamageStrengthTypeSphinx
enum class EDamageStrengthTypeSphinx : uint8_t
{
	EDSTRS_Weak                                        = 0,
	EDSTRS_Light                                       = 1,
	EDSTRS_Medium                                      = 2,
	EDSTRS_Heavy                                       = 3,
	EDSTRS_HeaveyWithoutKnockback                      = 4,
	EDSTRS_END                                         = 5
};


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class Kynapse.FpdBuilder
// 0x0069 (0x003C - 0x00A5)
class UFpdBuilder : public UObject
{
public:
	uint32_t                                           Active : 1;                                    // 0x003C (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	uint32_t                                           displayInGame : 1;                             // 0x003C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	struct FPrelinkProcessParams                       preLinkerProcess;                              // 0x0040 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	struct FFpdBuilderParams                           FpdBuilder;                                    // 0x004C (0x0044) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class UKynapseTag*                                 DataTag;                                       // 0x0090 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UKynapseFpdDatabase*                         database;                                      // 0x0094 (0x0004) [0x000000000440000B] (CPF_Edit | CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline)
	class TArray<class UKynapseAdditionalData*>        AdditionalDataList;                            // 0x0098 (0x000C) [0x000000000440000B] (CPF_Edit | CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline)
	EDisplayInEditorType                               displayInEditor;                               // 0x00A4 (0x0001) [0x0000000000000001] (CPF_Edit)    

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.FpdBuilder");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseActorFactoryAI
// 0x0004 (0x0084 - 0x0088)
class UKynapseActorFactoryAI : public UActorFactoryAI
{
public:
	class UKynapseEntityDefinitionActive*              kynapseDefinition;                             // 0x0084 (0x0004) [0x0000000000000001] (CPF_Edit)    

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseActorFactoryAI");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseAdditionalData
// 0x0018 (0x003C - 0x0054)
class UKynapseAdditionalData : public UObject
{
public:
	class TArray<uint8_t>                              Data;                                          // 0x003C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      MultiAdditionalClassName;                      // 0x0048 (0x000C) [0x0000000000400002] (CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseAdditionalData");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdAdditionalDataVertex
// 0x0000 (0x0054 - 0x0054)
class UKynapseFpdAdditionalDataVertex : public UKynapseAdditionalData
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdAdditionalDataVertex");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdAdditionalDataVertexHidingData
// 0x0000 (0x0054 - 0x0054)
class UKynapseFpdAdditionalDataVertexHidingData : public UKynapseFpdAdditionalDataVertex
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdAdditionalDataVertexHidingData");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseAgent
// 0x0030 (0x003C - 0x006C)
class UKynapseAgent : public UObject
{
public:
	class TArray<struct FAgentAperiodicTask>           time_aperiodicTasksList;                       // 0x003C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class TArray<struct FAgentPeriodicTask>            time_periodicTasksList;                        // 0x0048 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class FString                                      agentName;                                     // 0x0054 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class FString                                      ClassName;                                     // 0x0060 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseAgent");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdAgentFlee
// 0x0024 (0x006C - 0x0090)
class UKynapseFpdAgentFlee : public UKynapseAgent
{
public:
	class UKynapseFpdTraversalDefinitionFlee*          FpdFleeTraversal;                              // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              Speed;                                         // 0x0070 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           StopWhenSafe : 1;                              // 0x0074 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	float                                              FindSafePlaceInterval;                         // 0x0078 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      CheckDangerVisible;                            // 0x007C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	int32_t                                            MaxDangerousEntities;                          // 0x0088 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            MaxDangerousPoints;                            // 0x008C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdAgentFlee");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdAgentFollow
// 0x001C (0x006C - 0x0088)
class UKynapseFpdAgentFollow : public UKynapseAgent
{
public:
	float                                              DistFromEntity;                                // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              AngleFromEntity;                               // 0x0070 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              MinimalImportantMove;                          // 0x0074 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              Speed;                                         // 0x0078 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      AperiodicTask;                                 // 0x007C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdAgentFollow");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdAgentGoto
// 0x0004 (0x006C - 0x0070)
class UKynapseFpdAgentGoto : public UKynapseAgent
{
public:
	float                                              Speed;                                         // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdAgentGoto");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdAgentHide
// 0x0020 (0x006C - 0x008C)
class UKynapseFpdAgentHide : public UKynapseAgent
{
public:
	class UKynapseFpdTraversalDefinitionHide*          FpdHideTraversal;                              // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              Speed;                                         // 0x0070 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           StopWhenHidden : 1;                            // 0x0074 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	class FString                                      CheckIfHiddenTask;                             // 0x0078 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	int32_t                                            MaxDangerousEntities;                          // 0x0084 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            MaxDangerousPoints;                            // 0x0088 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdAgentHide");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdAgentShoot
// 0x0024 (0x006C - 0x0090)
class UKynapseFpdAgentShoot : public UKynapseAgent
{
public:
	float                                              GunRange;                                      // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              DangerousConeAngle;                            // 0x0070 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              LineOfFireValidityInterval;                    // 0x0074 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            NumPotentialSideSteps;                         // 0x0078 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              SideStepAngle;                                 // 0x007C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              Speed;                                         // 0x0080 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      CheckLineOfFireTask;                           // 0x0084 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdAgentShoot");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdAgentWander
// 0x0008 (0x006C - 0x0074)
class UKynapseFpdAgentWander : public UKynapseAgent
{
public:
	class UKynapseFpdTraversalDefinitionWander*        FpdWanderTraversal;                            // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              Speed;                                         // 0x0070 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdAgentWander");
		}

		return uClassPointer;
	};

};

// Class Kynapse.SphinxAgentChase
// 0x0000 (0x006C - 0x006C)
class USphinxAgentChase : public UKynapseAgent
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.SphinxAgentChase");
		}

		return uClassPointer;
	};

};

// Class Kynapse.SphinxAgentCommonInfo
// 0x0000 (0x006C - 0x006C)
class USphinxAgentCommonInfo : public UKynapseAgent
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.SphinxAgentCommonInfo");
		}

		return uClassPointer;
	};

};

// Class Kynapse.SphinxAgentFight
// 0x0074 (0x006C - 0x00E0)
class USphinxAgentFight : public UKynapseAgent
{
public:
	float                                              m_NearGroupDistance;                           // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_NearGroupSkipCheckMultiFactor;               // 0x0070 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_NearGroupDistanceOffset;                     // 0x0074 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            m_NearGroupFormationAngle;                     // 0x0078 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_FarGroupDistance;                            // 0x007C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_FarGroupDistanceOffset;                      // 0x0080 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            m_FarGroupFormationAngle;                      // 0x0084 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            m_NearGroupMaxPawn;                            // 0x0088 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            m_FarGroupMaxPawn;                             // 0x008C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_ChanceSwitchToFarGroup;                      // 0x0090 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_ChanceSwitchToNearGroup;                     // 0x0094 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           m_ChooseNearGroupFirst : 1;                    // 0x0098 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           m_SwarmCircleActived : 1;                      // 0x0098 (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	float                                              m_ShuffleDelay;                                // 0x009C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            m_SwarmFanAngle;                               // 0x00A0 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_SwarmSubOffset;                              // 0x00A4 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            m_SwarmMainCount;                              // 0x00A8 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            m_SwarmSubCount;                               // 0x00AC (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class TArray<struct FSphinxMeleeAttackInfo>        m_MeleeAttackInfo;                             // 0x00B0 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class TArray<struct FSphinxRangeAttackInfo>        m_RangeAttackInfo;                             // 0x00BC (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class TArray<struct FSphinxMiscActionInfo>         m_MiscActionInfo;                              // 0x00C8 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class TArray<struct FSphinxFightSwitchCondition>   m_ConditionArray;                              // 0x00D4 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.SphinxAgentFight");
		}

		return uClassPointer;
	};

};

// Class Kynapse.SphinxAgentFlee
// 0x0000 (0x006C - 0x006C)
class USphinxAgentFlee : public UKynapseAgent
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.SphinxAgentFlee");
		}

		return uClassPointer;
	};

};

// Class Kynapse.SphinxAgentFollow
// 0x001C (0x006C - 0x0088)
class USphinxAgentFollow : public UKynapseAgent
{
public:
	float                                              DistFromEntity;                                // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              AngleFromEntity;                               // 0x0070 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              MinimalImportantMove;                          // 0x0074 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              Speed;                                         // 0x0078 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      AperiodicTask;                                 // 0x007C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.SphinxAgentFollow");
		}

		return uClassPointer;
	};

};

// Class Kynapse.SphinxAgentGoto
// 0x0018 (0x006C - 0x0084)
class USphinxAgentGoto : public UKynapseAgent
{
public:
	float                                              Speed;                                         // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FRotator                                    m_DefaultRotatorRate;                          // 0x0070 (0x000C) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_SpeedReduceFactor;                           // 0x007C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_ReachedFactor;                               // 0x0080 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.SphinxAgentGoto");
		}

		return uClassPointer;
	};

};

// Class Kynapse.SphinxAgentHide
// 0x0000 (0x006C - 0x006C)
class USphinxAgentHide : public UKynapseAgent
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.SphinxAgentHide");
		}

		return uClassPointer;
	};

};

// Class Kynapse.SphinxAgentInterestPointAlert
// 0x0004 (0x006C - 0x0070)
class USphinxAgentInterestPointAlert : public UKynapseAgent
{
public:
	uint32_t                                           IPAlertIsOn : 1;                               // 0x006C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.SphinxAgentInterestPointAlert");
		}

		return uClassPointer;
	};

};

// Class Kynapse.SphinxAgentShoot
// 0x0000 (0x006C - 0x006C)
class USphinxAgentShoot : public UKynapseAgent
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.SphinxAgentShoot");
		}

		return uClassPointer;
	};

};

// Class Kynapse.SphinxAgentWander
// 0x0024 (0x006C - 0x0090)
class USphinxAgentWander : public UKynapseAgent
{
public:
	class USphinxTraversalDefinitionWander*            HierarchicalWanderTraversal;                   // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_Speed;                                       // 0x0070 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FRotator                                    m_RotationRate;                                // 0x0074 (0x000C) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           m_bAvoidsPlayer : 1;                           // 0x0080 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           m_bAvoidsNPCs : 1;                             // 0x0080 (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	float                                              m_WanderTime;                                  // 0x0084 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_IdleChance;                                  // 0x0088 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              m_IdleTime;                                    // 0x008C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.SphinxAgentWander");
		}

		return uClassPointer;
	};

};

// Class Kynapse.SphinxAgentWayPath
// 0x0018 (0x006C - 0x0084)
class USphinxAgentWayPath : public UKynapseAgent
{
public:
	float                                              m_Speed;                                       // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FRotator                                    m_RotationRate;                                // 0x0070 (0x000C) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           m_bAvoidsPawn : 1;                             // 0x007C (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           m_bPushPawn : 1;                               // 0x007C (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	uint32_t                                           m_bStopsWithPawn : 1;                          // 0x007C (0x0004) [0x0000000000000003] [0x00000004] (CPF_Edit | CPF_Const)
	float                                              m_PathEndTime;                                 // 0x0080 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.SphinxAgentWayPath");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseAIController
// 0x0070 (0x03DC - 0x044C)
class AKynapseAIController : public AAIController
{
public:
	class AActor*                                      hideAndShootTarget;                            // 0x03DC (0x0004) [0x0000000000002000] (CPF_Transient)
	class AActor*                                      shootTarget;                                   // 0x03E0 (0x0004) [0x0000000000002000] (CPF_Transient)
	class AActor*                                      followTarget;                                  // 0x03E4 (0x0004) [0x0000000000002000] (CPF_Transient)
	class APawn*                                       tmpPawn;                                       // 0x03E8 (0x0004) [0x0000000000002000] (CPF_Transient)
	class UKynapseHandle*                              myKynapseHandle;                               // 0x03EC (0x0004) [0x0000000004082008] (CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline)
	struct FPointer                                    KynapseEntity;                                 // 0x03F0 (0x0004) [0x0000000000000000]               
	float                                              activityTimer;                                 // 0x03F4 (0x0004) [0x0000000000000000]               
	uint32_t                                           pathComputed : 1;                              // 0x03F8 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           newLatentAction : 1;                           // 0x03F8 (0x0004) [0x0000000000002000] [0x00000002] (CPF_Transient)
	float                                              taskDuration;                                  // 0x03FC (0x0004) [0x0000000000000000]               
	class AActor*                                      DangerousNode;                                 // 0x0400 (0x0004) [0x0000000000000000]               
	class AActor*                                      DangerousEntity;                               // 0x0404 (0x0004) [0x0000000000002000] (CPF_Transient)
	class TArray<class AActor*>                        FleeDangerousNodes;                            // 0x0408 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<class AActor*>                        FleeDangerousEntities;                         // 0x0414 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<class AActor*>                        HideDangerousNodes;                            // 0x0420 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<class AActor*>                        HideDangerousEntities;                         // 0x042C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FVector                                     latentDestination;                             // 0x0438 (0x000C) [0x0000000000002000] (CPF_Transient)
	class AActor*                                      latentTarget;                                  // 0x0444 (0x0004) [0x0000000000002000] (CPF_Transient)
	float                                              latentDuration;                                // 0x0448 (0x0004) [0x0000000000002000] (CPF_Transient)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseAIController");
		}

		return uClassPointer;
	};

	void OnAIFollow(class USeqAct_AIFollow* Action);
	void OnAIShoot(class USeqAct_AIShoot* Action);
	void OnAIHide(class USeqAct_AIHide* Action);
	void OnAIFlee(class USeqAct_AIFlee* Action);
	void OnAIWander(class USeqAct_AIWander* Action);
	void Possess(class APawn* aPawn, bool bVehicleTransition);
	bool KynapseFollow(class AActor* TargetEntity, float Duration);
	bool KynapseShoot(class AActor* TargetEntity, float Duration);
	bool KynapseHide(float Duration);
	bool KynapseFlee(float Duration);
	bool KynapseWander(float Duration);
	bool KynapseGoTo(const struct FVector& KynapseDestination);
	void SetBrainState(int32_t Set);
	int32_t GetBrainState();
	void ActivateKynapseBrain(bool Activate);
	bool KynapseHasArrived(const struct FVector& Dest);
	void eventHearNoise(float Loudness, class AActor* NoiseMaker, const class FName& optionalNoiseType);
};

// Class Kynapse.KynapseAiMeshLayerDefinition
// 0x000C (0x003C - 0x0048)
class UKynapseAiMeshLayerDefinition : public UObject
{
public:
	class FString                                      ClassName;                                     // 0x003C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseAiMeshLayerDefinition");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseObstacleLayerDefinition
// 0x0028 (0x0048 - 0x0070)
class UKynapseObstacleLayerDefinition : public UKynapseAiMeshLayerDefinition
{
public:
	int32_t                                            maxMeshCount;                                  // 0x0048 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            maxObstacles;                                  // 0x004C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      aiMeshAccessorClassName;                       // 0x0050 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class FString                                      obstaclesAccessorClassName;                    // 0x005C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class UKynapseTag*                                 pathdataTag;                                   // 0x0068 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            MaxProjections;                                // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseObstacleLayerDefinition");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseBrain
// 0x0068 (0x003C - 0x00A4)
class UKynapseBrain : public UObject
{
public:
	class FString                                      brainName;                                     // 0x003C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class FString                                      ClassName;                                     // 0x0048 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class UKynapseBrainService*                        servicesList[5];                               // 0x0054 (0x0014) [0x000000000440000B] (CPF_Edit | CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline)
	class UKynapseAgent*                               agentsList[15];                                // 0x0068 (0x003C) [0x000000000440000B] (CPF_Edit | CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseBrain");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseBrainService
// 0x0030 (0x003C - 0x006C)
class UKynapseBrainService : public UObject
{
public:
	class TArray<struct FBServiceAperiodicTask>        time_aperiodicTasksList;                       // 0x003C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class TArray<struct FBServicePeriodicTask>         time_periodicTasksList;                        // 0x0048 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class FString                                      serviceName;                                   // 0x0054 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class FString                                      ClassName;                                     // 0x0060 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseBrainService");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseBrainServiceFpdPathfinder
// 0x0068 (0x006C - 0x00D4)
class UKynapseBrainServiceFpdPathfinder : public UKynapseBrainService
{
public:
	class UKynapseFpdDatabase*                         database;                                      // 0x006C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FFpdModifiers                               Modifiers;                                     // 0x0070 (0x0030) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	uint32_t                                           AvoidCpuPeaks : 1;                             // 0x00A0 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	float                                              CpuPrudence;                                   // 0x00A4 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              MaxPathSize;                                   // 0x00A8 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            PathObjectMemory;                              // 0x00AC (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FLocalPathFinding_Fpd                       lpfConfig;                                     // 0x00B0 (0x0024) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseBrainServiceFpdPathfinder");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseEngineService
// 0x0018 (0x003C - 0x0054)
class UKynapseEngineService : public UObject
{
public:
	class FString                                      serviceName;                                   // 0x003C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class FString                                      ClassName;                                     // 0x0048 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseEngineService");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseEngineServiceFpdPathDataManager
// 0x0008 (0x0054 - 0x005C)
class UKynapseEngineServiceFpdPathDataManager : public UKynapseEngineService
{
public:
	int32_t                                            MaxRegisteredCallbacks;                        // 0x0054 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            AstarMemory;                                   // 0x0058 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseEngineServiceFpdPathDataManager");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseEntityDefinition
// 0x0000 (0x003C - 0x003C)
class UKynapseEntityDefinition : public UObject
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseEntityDefinition");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseEntityDefinitionActive
// 0x0028 (0x003C - 0x0064)
class UKynapseEntityDefinitionActive : public UKynapseEntityDefinition
{
public:
	class FString                                      EntityClassName;                               // 0x003C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class FString                                      ActionClassName;                               // 0x0048 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class UKynapseBrain*                               KynapseBrainDefinition;                        // 0x0054 (0x0004) [0x000000000440000B] (CPF_Edit | CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline)
	class UKynapseProfileDefinition*                   Profile;                                       // 0x0058 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UKynapseMesh*                                AiMesh;                                        // 0x005C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UKynapseTag*                                 DefaultDataTag;                                // 0x0060 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseEntityDefinitionActive");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseEntityDefinitionPassive
// 0x0010 (0x003C - 0x004C)
class UKynapseEntityDefinitionPassive : public UKynapseEntityDefinition
{
public:
	class FString                                      EntityClassName;                               // 0x003C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class UKynapseProfileDefinition*                   Profile;                                       // 0x0048 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseEntityDefinitionPassive");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseEntityDefinitionPathObject
// 0x0008 (0x004C - 0x0054)
class UKynapseEntityDefinitionPathObject : public UKynapseEntityDefinitionPassive
{
public:
	int32_t                                            PoolCount;                                     // 0x004C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            MaxLinkedEdges;                                // 0x0050 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseEntityDefinitionPathObject");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseEntityDefinitionDynamicPathObject
// 0x0004 (0x0054 - 0x0058)
class UKynapseEntityDefinitionDynamicPathObject : public UKynapseEntityDefinitionPathObject
{
public:
	class UKynapseTag*                                 ImpactedDataTag;                               // 0x0054 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseEntityDefinitionDynamicPathObject");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseEntityDefinitionStaticPathObject
// 0x0010 (0x0054 - 0x0064)
class UKynapseEntityDefinitionStaticPathObject : public UKynapseEntityDefinitionPathObject
{
public:
	int32_t                                            TypeId;                                        // 0x0054 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      TypeName;                                      // 0x0058 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseEntityDefinitionStaticPathObject");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseEntityInfoDefinition
// 0x001C (0x003C - 0x0058)
class UKynapseEntityInfoDefinition : public UObject
{
public:
	class FString                                      infoClass;                                     // 0x003C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	float                                              validTime;                                     // 0x0048 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              unsafeTime;                                    // 0x004C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              estimatedComputationTime;                      // 0x0050 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           immediateMode : 1;                             // 0x0054 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseEntityInfoDefinition");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseExclusionVolume
// 0x0000 (0x0268 - 0x0268)
class AKynapseExclusionVolume : public ABlockingVolume
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseExclusionVolume");
		}

		return uClassPointer;
	};

	bool StopsProjectile(class AProjectile* P);
};

// Class Kynapse.KynapseExplorationVolume
// 0x0000 (0x0264 - 0x0264)
class AKynapseExplorationVolume : public ATriggerVolume
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseExplorationVolume");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFilter
// 0x000C (0x003C - 0x0048)
class UKynapseFilter : public UObject
{
public:
	class FString                                      filterClass;                                   // 0x003C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFilter");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFilterDistance
// 0x0010 (0x0048 - 0x0058)
class UKynapseFilterDistance : public UKynapseFilter
{
public:
	struct FVector                                     ReferencePoint;                                // 0x0048 (0x000C) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              Distance;                                      // 0x0054 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFilterDistance");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFilterFrustum
// 0x0024 (0x0048 - 0x006C)
class UKynapseFilterFrustum : public UKynapseFilter
{
public:
	struct FVector                                     EyePosition;                                   // 0x0048 (0x000C) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FVector                                     At;                                            // 0x0054 (0x000C) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              NearClip;                                      // 0x0060 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              FarClip;                                       // 0x0064 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              Angle;                                         // 0x0068 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFilterFrustum");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFilterUnconditional
// 0x0000 (0x0048 - 0x0048)
class UKynapseFilterUnconditional : public UKynapseFilter
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFilterUnconditional");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdDatabase
// 0x000C (0x003C - 0x0048)
class UKynapseFpdDatabase : public UObject
{
public:
	struct FFpdDatabase                                Settings;                                      // 0x003C (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdDatabase");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdTraversalDefinition
// 0x0028 (0x003C - 0x0064)
class UKynapseFpdTraversalDefinition : public UObject
{
public:
	struct FFpdTraversalAperiodicTask                  AperiodicTask;                                 // 0x003C (0x0018) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	int32_t                                            InstanceCount;                                 // 0x0054 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      ClassName;                                     // 0x0058 (0x000C) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdTraversalDefinition");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdTraversalDefinitionFlee
// 0x0008 (0x0064 - 0x006C)
class UKynapseFpdTraversalDefinitionFlee : public UKynapseFpdTraversalDefinition
{
public:
	float                                              MaxDistance;                                   // 0x0064 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              MaxCost;                                       // 0x0068 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdTraversalDefinitionFlee");
		}

		return uClassPointer;
	};

};

// Class Kynapse.KynapseFpdTraversalDefinitionHide
// 0x0008 (0x0064 - 0x006C)
class UKynapseFpdTraversalDefinitionHide : public UKynapseFpdTraversalDefinition
{
public:
	float                                              MaxDistance;                                   // 0x0064 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              MaxCost;                                       // 0x0068 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class Kynapse.KynapseFpdTraversalDefinitionHide");
		}

		return uClassPointer;
