/*
#############################################################################################
# Alice2 (ASDK) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.6
# ========================================================================================= #
# File: WinDrv_classes.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

// Forward Declarations
class UClass;
class UFunction;
class UProperty;
class UStructProperty;
class UStruct;


/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/


/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class WinDrv.WindowsClient
// 0x01B0 (0x0050 - 0x0200)
class UWindowsClient : public UClient
{
public:
	uint8_t                                            UnknownData00[0x16C];                          // 0x0050 (0x016C) MISSED OFFSET
	class UClass*                                      AudioDeviceClass;                              // 0x01BC (0x0004) [0x0000000000004000] (CPF_Config)  
	uint8_t                                            UnknownData01[0x2C];                            // 0x01C0 (0x002C) MISSED OFFSET
	int32_t                                            AllowJoystickInput;                            // 0x01EC (0x0004) [0x0000000000004000] (CPF_Config)  
	uint8_t                                            UnknownData02[0x10];                            // 0x01F0 (0x0010) MISSED OFFSET

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class WinDrv.WindowsClient");
		}

		return uClassPointer;
	};

};

// Class WinDrv.XnaForceFeedbackManager
// 0x0000 (0x0050 - 0x0050)
class UXnaForceFeedbackManager : public UForceFeedbackManager
{
public:

public:
	static UClass* StaticClass()
	{
		static UClass* uClassPointer = nullptr;

		if (!uClassPointer)
		{
			uClassPointer = UObject::FindClass("Class WinDrv.XnaForceFeedbackManager");
		}

		return uClassPointer;
	};

};

/*
# ========================================================================================= #
#
# ========================================================================================= #
*/

#ifdef _MSC_VER
#pragma pack(pop)
#endif
